hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * Copyright (c) 2021 hpmicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_USB_H
#define HPM_USB_H

typedef struct {
    __R  uint32_t ID;                          /* 0x0: Identification Register */
    __R  uint32_t HWGENERAL;                   /* 0x4: Hardware General Register */
    __R  uint32_t HWHOST;                      /* 0x8: Host Hardware Parameter Register */
    __R  uint32_t HWDEVICE;                    /* 0xC: Device Hardware Parameter Register */
    __R  uint32_t HWTXBUF;                     /* 0x10: TX Buffer Hardware Parameter Register */
    __R  uint32_t HWRXBUF;                     /* 0x14: RX Buffer Hardware Parameter Register */
    __R  uint8_t  RESERVED0[104];              /* 0x18 - 0x7F: Reserved */
    __RW uint32_t GPTIMER0LD;                  /* 0x80: General Purpose Timer #0 Load Register */
    __RW uint32_t GPTIMER0CTRL;                /* 0x84: General Purpose Timer #0 Controller Register */
    __RW uint32_t GPTIMER1LD;                  /* 0x88: General Purpose Timer #1 Load Register */
    __RW uint32_t GPTIMER1CTRL;                /* 0x8C: General Purpose Timer #1 Controller Register */
    __RW uint32_t SBUSCFG;                     /* 0x90: System Bus Config Register */
    __R  uint8_t  RESERVED1[108];              /* 0x94 - 0xFF: Reserved */
    __R  uint8_t  CAPLENGTH;                   /* 0x100: Capability Registers Length Register */
    __R  uint8_t  RESERVED2;                   /* 0x101: Reserved */
    __R  uint16_t HCIVERSION;                  /* 0x102: Host Controller Interface Version Register */
    __R  uint32_t HCSPARAMS;                   /* 0x104: Host Controller Structural Parameter Register */
    __R  uint32_t HCCPARAMS;                   /* 0x108: Host Controller Capability Parameter Register */
    __R  uint8_t  RESERVED3[20];               /* 0x10C - 0x11F: Reserved */
    __R  uint16_t DCIVERSION;                  /* 0x120: Device Controller Interface Version Register */
    __R  uint8_t  RESERVED4[2];                /* 0x122 - 0x123: Reserved */
    __R  uint32_t DCCPARAMS;                   /* 0x124: Device Controller Capability Parameter Register */
    __R  uint8_t  RESERVED5[24];               /* 0x128 - 0x13F: Reserved */
    __RW uint32_t USBCMD;                      /* 0x140: USB Command Register */
    __RW uint32_t USBSTS;                      /* 0x144: USB Status Register */
    __RW uint32_t USBINTR;                     /* 0x148: Interrupt Enable Register */
    __RW uint32_t FRINDEX;                     /* 0x14C: USB Frame Index Register */
    __R  uint8_t  RESERVED6[4];                /* 0x150 - 0x153: Reserved */
    union {
        __RW uint32_t DEVICEADDR;              /* 0x154: Device Address Register */
        __RW uint32_t PERIODICLISTBASE;        /* 0x154: Frame List Base Address Register */
    };
    union {
        __RW uint32_t ASYNCLISTADDR;           /* 0x158: Next Asynch. Address Register */
        __RW uint32_t ENDPTLISTADDR;           /* 0x158: Endpoint List Address Register */
    };
    __R  uint8_t  RESERVED7[4];                /* 0x15C - 0x15F: Reserved */
    __RW uint32_t BURSTSIZE;                   /* 0x160: Programmable Burst Size Register */
    __RW uint32_t TXFILLTUNING;                /* 0x164: TX FIFO Fill Tuning Register */
    __R  uint8_t  RESERVED8[16];               /* 0x168 - 0x177: Reserved */
    __RW uint32_t ENDPTNAK;                    /* 0x178: Endpoint NAK Register */
    __RW uint32_t ENDPTNAKEN;                  /* 0x17C: Endpoint NAK Enable Register */
    __R  uint32_t CONFIGFLAG;                  /* 0x180: Configure Flag Register */
    __RW uint32_t PORTSC1;                     /* 0x184: Port Status & Control */
    __R  uint8_t  RESERVED9[28];               /* 0x188 - 0x1A3: Reserved */
    __RW uint32_t OTGSC;                       /* 0x1A4: On-The-Go Status & control Register */
    __RW uint32_t USBMODE;                     /* 0x1A8: USB Device Mode Register */
    __RW uint32_t ENDPTSETUPSTAT;              /* 0x1AC: Endpoint Setup Status Register */
    __RW uint32_t ENDPTPRIME;                  /* 0x1B0: Endpoint Prime Register */
    __RW uint32_t ENDPTFLUSH;                  /* 0x1B4: Endpoint Flush Register */
    __R  uint32_t ENDPTSTAT;                   /* 0x1B8: Endpoint Status Register */
    __RW uint32_t ENDPTCOMPLETE;               /* 0x1BC: Endpoint Complete Register */
    __RW uint32_t ENDPTCTRL[8];                /* 0x1C0 - 0x1DC: Endpoint Control0 Register... Endpoint Control7 Register */
    __R  uint8_t  RESERVED10[32];              /* 0x1E0 - 0x1FF: Reserved */
    __RW uint32_t OTG_CTRL0;                   /* 0x200:  */
    __RW uint32_t OTG_CTRL1;                   /* 0x204:  */
    __R  uint8_t  RESERVED11[8];               /* 0x208 - 0x20F: Reserved */
    __RW uint32_t PHY_CTRL0;                   /* 0x210:  */
    __RW uint32_t PHY_CTRL1;                   /* 0x214:  */
    __R  uint8_t  RESERVED12[8];               /* 0x218 - 0x21F: Reserved */
    __RW uint32_t TOP_STATUS;                  /* 0x220:  */
    __RW uint32_t PHY_STATUS;                  /* 0x224:  */
} USB_Type;


/* Bitfield definition for register: ID */
/*
 * REVISION (RO)
 *
 * Revision number of the controller core
 */
#define USB_ID_REVISION_MASK (0xFF0000UL)
#define USB_ID_REVISION_SHIFT (16U)
#define USB_ID_REVISION_GET(x) (((uint32_t)(x) & USB_ID_REVISION_MASK) >> USB_ID_REVISION_SHIFT)

/*
 * NID (RO)
 *
 * Complement version of ID
 */
#define USB_ID_NID_MASK (0x3F00U)
#define USB_ID_NID_SHIFT (8U)
#define USB_ID_NID_GET(x) (((uint32_t)(x) & USB_ID_NID_MASK) >> USB_ID_NID_SHIFT)

/*
 * ID (RO)
 *
 * Configuration number.This number indicates the type of the USB-HS 2.0 core.
 */
#define USB_ID_ID_MASK (0x3FU)
#define USB_ID_ID_SHIFT (0U)
#define USB_ID_ID_GET(x) (((uint32_t)(x) & USB_ID_ID_MASK) >> USB_ID_ID_SHIFT)

/* Bitfield definition for register: HWGENERAL */
/*
 * SM (RO)
 *
 * Serial interface mode capability
 * 00 - No Serial Engine, always use parallel signalling.
 * 01 - Serial Engine present, always use serial signalling for FS/LS.
 * 10 - Software programmable - Reset to use parallel signalling for FS/LS
 * 11 - Software programmable - Reset to use serial signalling for FS/LS
 */
#define USB_HWGENERAL_SM_MASK (0xC00U)
#define USB_HWGENERAL_SM_SHIFT (10U)
#define USB_HWGENERAL_SM_GET(x) (((uint32_t)(x) & USB_HWGENERAL_SM_MASK) >> USB_HWGENERAL_SM_SHIFT)

