hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * PHYM (RO)
 *
 * PHYM
 * Transciever type
 * 000 - UTMI/UMTI+
 * 001 - ULPI DDR
 * 010 - ULPI
 * 011 - Serial Only
 * 100 - Software programmable - reset to UTMI/UTMI+
 * 101 - Software programmable - reset to ULPI DDR
 * 110 - Software programmable - reset to ULPI
 * 111 - Software programmable - reset to Serial
 */
#define USB_HWGENERAL_PHYM_MASK (0x3C0U)
#define USB_HWGENERAL_PHYM_SHIFT (6U)
#define USB_HWGENERAL_PHYM_GET(x) (((uint32_t)(x) & USB_HWGENERAL_PHYM_MASK) >> USB_HWGENERAL_PHYM_SHIFT)

/*
 * PHYW (RO)
 *
 * PHYW
 * Data width of the transciever connected to the controller core.
 * 00 - 8 bit wide data bus (Software non-programmable)
 * 01 - 16 bit wide data bus (Software non-programmable)
 * 10 - Reset to 8 bit wide data bus (Software programmable)
 * 11 - Reset to 16 bit wide data bus (Software programmable)
 */
#define USB_HWGENERAL_PHYW_MASK (0x30U)
#define USB_HWGENERAL_PHYW_SHIFT (4U)
#define USB_HWGENERAL_PHYW_GET(x) (((uint32_t)(x) & USB_HWGENERAL_PHYW_MASK) >> USB_HWGENERAL_PHYW_SHIFT)

/* Bitfield definition for register: HWHOST */
/*
 * NPORT (RO)
 *
 * NPORT
 * The Nmber of downstream ports supported by the host controller is (NPORT+1).
 * NOTE: When these bits value is '000', it indicates a single-port host controller.
 */
#define USB_HWHOST_NPORT_MASK (0xEU)
#define USB_HWHOST_NPORT_SHIFT (1U)
#define USB_HWHOST_NPORT_GET(x) (((uint32_t)(x) & USB_HWHOST_NPORT_MASK) >> USB_HWHOST_NPORT_SHIFT)

/*
 * HC (RO)
 *
 * HC
 * Host Capable.
 * Indicating whether host operation mode is supported or not.
 * 0 - Not supported
 * 1 - Supported
 */
#define USB_HWHOST_HC_MASK (0x1U)
#define USB_HWHOST_HC_SHIFT (0U)
#define USB_HWHOST_HC_GET(x) (((uint32_t)(x) & USB_HWHOST_HC_MASK) >> USB_HWHOST_HC_SHIFT)

/* Bitfield definition for register: HWDEVICE */
/*
 * DEVEP (RO)
 *
 * DEVEP
 * Device Endpoint Number
 */
#define USB_HWDEVICE_DEVEP_MASK (0x3EU)
#define USB_HWDEVICE_DEVEP_SHIFT (1U)
#define USB_HWDEVICE_DEVEP_GET(x) (((uint32_t)(x) & USB_HWDEVICE_DEVEP_MASK) >> USB_HWDEVICE_DEVEP_SHIFT)

/*
 * DC (RO)
 *
 * DC
 * Device Capable.
 * Indicating whether device operation mode is supported or not.
 * 0 - Not supported
 * 1 - Supported
 */
#define USB_HWDEVICE_DC_MASK (0x1U)
#define USB_HWDEVICE_DC_SHIFT (0U)
#define USB_HWDEVICE_DC_GET(x) (((uint32_t)(x) & USB_HWDEVICE_DC_MASK) >> USB_HWDEVICE_DC_SHIFT)

/* Bitfield definition for register: HWTXBUF */
/*
 * TXCHANADD (RO)
 *
 * TXCHANADD
 * TX FIFO Buffer size is: (2^TXCHANADD) * 4 Bytes.
 * These bits are set to '08h', so buffer size is 256*4 Bytes.
 * For the OTG controller operating in device mode, this is the FIFO buffer size per endpoint. As the OTG
 * controller has 8 TX endpoint, there are 8 of these buffers.
 * For the OTG controller operating in host mode, or for Host-only controller, the entire buffer memory is
 * used as a single TX buffer. Therefore, there is only 1 of this buffer
 */
#define USB_HWTXBUF_TXCHANADD_MASK (0xFF0000UL)
#define USB_HWTXBUF_TXCHANADD_SHIFT (16U)
#define USB_HWTXBUF_TXCHANADD_GET(x) (((uint32_t)(x) & USB_HWTXBUF_TXCHANADD_MASK) >> USB_HWTXBUF_TXCHANADD_SHIFT)

/*
 * TXBURST (RO)
 *
 * TXBURST
 * Default burst size for memory to TX buffer transfer.
 * This is reset value of TXPBURST bits in USB core register USB_n_BURSTSIZE.
 * Please see BURSTSIZE .
 */
#define USB_HWTXBUF_TXBURST_MASK (0xFFU)
#define USB_HWTXBUF_TXBURST_SHIFT (0U)
#define USB_HWTXBUF_TXBURST_GET(x) (((uint32_t)(x) & USB_HWTXBUF_TXBURST_MASK) >> USB_HWTXBUF_TXBURST_SHIFT)

/* Bitfield definition for register: HWRXBUF */
/*
 * RXADD (RO)
 *
 * RXADD
 * Buffer total size for all receive endpoints is (2^RXADD).
 * RX Buffer size is: (2^RXADD) * 4 Bytes.
 * These bits are set to '08h', so buffer size is 256*4 Bytes.
 * There is a single Receive FIFO buffer in the USB controller. The buffer is shared for all endpoints for the
 * OTG controller in device mode.
 */
#define USB_HWRXBUF_RXADD_MASK (0xFF00U)
#define USB_HWRXBUF_RXADD_SHIFT (8U)
#define USB_HWRXBUF_RXADD_GET(x) (((uint32_t)(x) & USB_HWRXBUF_RXADD_MASK) >> USB_HWRXBUF_RXADD_SHIFT)

/*
 * RXBURST (RO)
 *
 * RXBURST
 * Default burst size for memory to RX buffer transfer.
 * This is reset value of RXPBURST bits in USB core register USB_n_BURSTSIZE.
 * Please see BURSTSIZE .
 */
#define USB_HWRXBUF_RXBURST_MASK (0xFFU)
#define USB_HWRXBUF_RXBURST_SHIFT (0U)
#define USB_HWRXBUF_RXBURST_GET(x) (((uint32_t)(x) & USB_HWRXBUF_RXBURST_MASK) >> USB_HWRXBUF_RXBURST_SHIFT)

/* Bitfield definition for register: GPTIMER0LD */
/*
 * GPTLD (RW)
 *
 * GPTLD
 * General Purpose Timer Load Value
 * These bit fields are loaded to GPTCNT bits when GPTRST bit is set '1b'.
 * This value represents the time in microseconds minus 1 for the timer duration.
 * Example: for a one millisecond timer, load 1000-1=999 or 0x0003E7.
 * NOTE: Max value is 0xFFFFFF or 16.777215 seconds.
 */
#define USB_GPTIMER0LD_GPTLD_MASK (0xFFFFFFUL)
#define USB_GPTIMER0LD_GPTLD_SHIFT (0U)
#define USB_GPTIMER0LD_GPTLD_SET(x) (((uint32_t)(x) << USB_GPTIMER0LD_GPTLD_SHIFT) & USB_GPTIMER0LD_GPTLD_MASK)
#define USB_GPTIMER0LD_GPTLD_GET(x) (((uint32_t)(x) & USB_GPTIMER0LD_GPTLD_MASK) >> USB_GPTIMER0LD_GPTLD_SHIFT)

/* Bitfield definition for register: GPTIMER0CTRL */
/*
 * GPTRUN (RW)
 *
 * GPTRUN
 * General Purpose Timer Run
 * GPTCNT bits are not effected when setting or clearing this bit.
 * 0 - Stop counting
 * 1 - Run
 */
#define USB_GPTIMER0CTRL_GPTRUN_MASK (0x80000000UL)
#define USB_GPTIMER0CTRL_GPTRUN_SHIFT (31U)
#define USB_GPTIMER0CTRL_GPTRUN_SET(x) (((uint32_t)(x) << USB_GPTIMER0CTRL_GPTRUN_SHIFT) & USB_GPTIMER0CTRL_GPTRUN_MASK)
#define USB_GPTIMER0CTRL_GPTRUN_GET(x) (((uint32_t)(x) & USB_GPTIMER0CTRL_GPTRUN_MASK) >> USB_GPTIMER0CTRL_GPTRUN_SHIFT)

/*
 * GPTRST (WO)
 *
 * GPTRST
 * General Purpose Timer Reset
 * 0 - No action
 * 1 - Load counter value from GPTLD bits in n_GPTIMER0LD
 */
#define USB_GPTIMER0CTRL_GPTRST_MASK (0x40000000UL)
#define USB_GPTIMER0CTRL_GPTRST_SHIFT (30U)
#define USB_GPTIMER0CTRL_GPTRST_SET(x) (((uint32_t)(x) << USB_GPTIMER0CTRL_GPTRST_SHIFT) & USB_GPTIMER0CTRL_GPTRST_MASK)
#define USB_GPTIMER0CTRL_GPTRST_GET(x) (((uint32_t)(x) & USB_GPTIMER0CTRL_GPTRST_MASK) >> USB_GPTIMER0CTRL_GPTRST_SHIFT)

