hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * GPTMODE (RW)
 *
 * GPTMODE
 * General Purpose Timer Mode
 * In one shot mode, the timer will count down to zero, generate an interrupt, and stop until the counter is
 * reset by software;
 * In repeat mode, the timer will count down to zero, generate an interrupt and automatically reload the
 * counter value from GPTLD bits to start again.
 * 0 - One Shot Mode
 * 1 - Repeat Mode
 */
#define USB_GPTIMER0CTRL_GPTMODE_MASK (0x1000000UL)
#define USB_GPTIMER0CTRL_GPTMODE_SHIFT (24U)
#define USB_GPTIMER0CTRL_GPTMODE_SET(x) (((uint32_t)(x) << USB_GPTIMER0CTRL_GPTMODE_SHIFT) & USB_GPTIMER0CTRL_GPTMODE_MASK)
#define USB_GPTIMER0CTRL_GPTMODE_GET(x) (((uint32_t)(x) & USB_GPTIMER0CTRL_GPTMODE_MASK) >> USB_GPTIMER0CTRL_GPTMODE_SHIFT)

/*
 * GPTCNT (RO)
 *
 * GPTCNT
 * General Purpose Timer Counter.
 * This field is the count value of the countdown timer.
 */
#define USB_GPTIMER0CTRL_GPTCNT_MASK (0xFFFFFFUL)
#define USB_GPTIMER0CTRL_GPTCNT_SHIFT (0U)
#define USB_GPTIMER0CTRL_GPTCNT_GET(x) (((uint32_t)(x) & USB_GPTIMER0CTRL_GPTCNT_MASK) >> USB_GPTIMER0CTRL_GPTCNT_SHIFT)

/* Bitfield definition for register: GPTIMER1LD */
/*
 * GPTLD (RW)
 *
 * GPTLD
 * General Purpose Timer Load Value
 * These bit fields are loaded to GPTCNT bits when GPTRST bit is set '1b'.
 * This value represents the time in microseconds minus 1 for the timer duration.
 * Example: for a one millisecond timer, load 1000-1=999 or 0x0003E7.
 * NOTE: Max value is 0xFFFFFF or 16.777215 seconds.
 */
#define USB_GPTIMER1LD_GPTLD_MASK (0xFFFFFFUL)
#define USB_GPTIMER1LD_GPTLD_SHIFT (0U)
#define USB_GPTIMER1LD_GPTLD_SET(x) (((uint32_t)(x) << USB_GPTIMER1LD_GPTLD_SHIFT) & USB_GPTIMER1LD_GPTLD_MASK)
#define USB_GPTIMER1LD_GPTLD_GET(x) (((uint32_t)(x) & USB_GPTIMER1LD_GPTLD_MASK) >> USB_GPTIMER1LD_GPTLD_SHIFT)

/* Bitfield definition for register: GPTIMER1CTRL */
/*
 * GPTRUN (RW)
 *
 * GPTRUN
 * General Purpose Timer Run
 * GPTCNT bits are not effected when setting or clearing this bit.
 * 0 - Stop counting
 * 1 - Run
 */
#define USB_GPTIMER1CTRL_GPTRUN_MASK (0x80000000UL)
#define USB_GPTIMER1CTRL_GPTRUN_SHIFT (31U)
#define USB_GPTIMER1CTRL_GPTRUN_SET(x) (((uint32_t)(x) << USB_GPTIMER1CTRL_GPTRUN_SHIFT) & USB_GPTIMER1CTRL_GPTRUN_MASK)
#define USB_GPTIMER1CTRL_GPTRUN_GET(x) (((uint32_t)(x) & USB_GPTIMER1CTRL_GPTRUN_MASK) >> USB_GPTIMER1CTRL_GPTRUN_SHIFT)

/*
 * GPTRST (WO)
 *
 * GPTRST
 * General Purpose Timer Reset
 * 0 - No action
 * 1 - Load counter value from GPTLD bits in USB_n_GPTIMER1LD
 */
#define USB_GPTIMER1CTRL_GPTRST_MASK (0x40000000UL)
#define USB_GPTIMER1CTRL_GPTRST_SHIFT (30U)
#define USB_GPTIMER1CTRL_GPTRST_SET(x) (((uint32_t)(x) << USB_GPTIMER1CTRL_GPTRST_SHIFT) & USB_GPTIMER1CTRL_GPTRST_MASK)
#define USB_GPTIMER1CTRL_GPTRST_GET(x) (((uint32_t)(x) & USB_GPTIMER1CTRL_GPTRST_MASK) >> USB_GPTIMER1CTRL_GPTRST_SHIFT)

/*
 * GPTMODE (RW)
 *
 * GPTMODE
 * General Purpose Timer Mode
 * In one shot mode, the timer will count down to zero, generate an interrupt, and stop until the counter is
 * reset by software. In repeat mode, the timer will count down to zero, generate an interrupt and
 * automatically reload the counter value from GPTLD bits to start again.
 * 0 - One Shot Mode
 * 1 - Repeat Mode
 */
#define USB_GPTIMER1CTRL_GPTMODE_MASK (0x1000000UL)
#define USB_GPTIMER1CTRL_GPTMODE_SHIFT (24U)
#define USB_GPTIMER1CTRL_GPTMODE_SET(x) (((uint32_t)(x) << USB_GPTIMER1CTRL_GPTMODE_SHIFT) & USB_GPTIMER1CTRL_GPTMODE_MASK)
#define USB_GPTIMER1CTRL_GPTMODE_GET(x) (((uint32_t)(x) & USB_GPTIMER1CTRL_GPTMODE_MASK) >> USB_GPTIMER1CTRL_GPTMODE_SHIFT)

/*
 * GPTCNT (RO)
 *
 * GPTCNT
 * General Purpose Timer Counter.
 * This field is the count value of the countdown timer.
 */
#define USB_GPTIMER1CTRL_GPTCNT_MASK (0xFFFFFFUL)
#define USB_GPTIMER1CTRL_GPTCNT_SHIFT (0U)
#define USB_GPTIMER1CTRL_GPTCNT_GET(x) (((uint32_t)(x) & USB_GPTIMER1CTRL_GPTCNT_MASK) >> USB_GPTIMER1CTRL_GPTCNT_SHIFT)

/* Bitfield definition for register: SBUSCFG */
/*
 * AHBBRST (RW)
 *
 * AHBBRST
 * AHB master interface Burst configuration
 * These bits control AHB master transfer type sequence (or priority).
 * NOTE: This register overrides n_BURSTSIZE register when its value is not zero.
 * 000 - Incremental burst of unspecified length only
 * 001 - INCR4 burst, then single transfer
 * 010 - INCR8 burst, INCR4 burst, then single transfer
 * 011 - INCR16 burst, INCR8 burst, INCR4 burst, then single transfer
 * 100 - Reserved, don't use
 * 101 - INCR4 burst, then incremental burst of unspecified length
 * 110 - INCR8 burst, INCR4 burst, then incremental burst of unspecified length
 * 111 - INCR16 burst, INCR8 burst, INCR4 burst, then incremental burst of unspecified length
 */
#define USB_SBUSCFG_AHBBRST_MASK (0x7U)
#define USB_SBUSCFG_AHBBRST_SHIFT (0U)
#define USB_SBUSCFG_AHBBRST_SET(x) (((uint32_t)(x) << USB_SBUSCFG_AHBBRST_SHIFT) & USB_SBUSCFG_AHBBRST_MASK)
#define USB_SBUSCFG_AHBBRST_GET(x) (((uint32_t)(x) & USB_SBUSCFG_AHBBRST_MASK) >> USB_SBUSCFG_AHBBRST_SHIFT)

/* Bitfield definition for register: CAPLENGTH */
/*
 * CAPLENGTH (RO)
 *
 * CAPLENGTH
 * These bits are used as an offset to add to register base to find the beginning of the Operational Register.
 * Default value is '40h'.
 */
#define USB_CAPLENGTH_CAPLENGTH_MASK (0xFFU)
#define USB_CAPLENGTH_CAPLENGTH_SHIFT (0U)
#define USB_CAPLENGTH_CAPLENGTH_GET(x) (((uint8_t)(x) & USB_CAPLENGTH_CAPLENGTH_MASK) >> USB_CAPLENGTH_CAPLENGTH_SHIFT)

/* Bitfield definition for register: HCIVERSION */
/*
 * HCIVERSION (RO)
 *
 * HCIVERSION
 * Host Controller Interface Version Number
 * Default value is '10h', which means EHCI rev1.0.
 */
#define USB_HCIVERSION_HCIVERSION_MASK (0xFFFFU)
#define USB_HCIVERSION_HCIVERSION_SHIFT (0U)
#define USB_HCIVERSION_HCIVERSION_GET(x) (((uint16_t)(x) & USB_HCIVERSION_HCIVERSION_MASK) >> USB_HCIVERSION_HCIVERSION_SHIFT)

/* Bitfield definition for register: HCSPARAMS */
/*
 * N_TT (RO)
 *
 * N_TT
 * Number of Transaction Translators (N_TT). Default value '0000b'
 * This field indicates the number of embedded transaction translators associated with the USB2.0 host
 * controller.
 * These bits would be set to '0001b' for Multi-Port Host, and '0000b' for Single-Port Host.
 */
#define USB_HCSPARAMS_N_TT_MASK (0xF000000UL)
#define USB_HCSPARAMS_N_TT_SHIFT (24U)
#define USB_HCSPARAMS_N_TT_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_N_TT_MASK) >> USB_HCSPARAMS_N_TT_SHIFT)

