hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * N_PTT (RO)
 *
 * N_PTT
 * Number of Ports per Transaction Translator (N_PTT). Default value '0000b'
 * This field indicates the number of ports assigned to each transaction translator within the USB2.0 host
 * controller.
 * These bits would be set to equal N_PORTS for Multi-Port Host, and '0000b' for Single-Port Host.
 */
#define USB_HCSPARAMS_N_PTT_MASK (0xF00000UL)
#define USB_HCSPARAMS_N_PTT_SHIFT (20U)
#define USB_HCSPARAMS_N_PTT_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_N_PTT_MASK) >> USB_HCSPARAMS_N_PTT_SHIFT)

/*
 * PI (RO)
 *
 * PI
 * Port Indicators (P INDICATOR)
 * This bit indicates whether the ports support port indicator control. When set to one, the port status and
 * control registers include a read/writeable field for controlling the state of the port indicator
 * This bit is "1b" in all controller core.
 */
#define USB_HCSPARAMS_PI_MASK (0x10000UL)
#define USB_HCSPARAMS_PI_SHIFT (16U)
#define USB_HCSPARAMS_PI_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_PI_MASK) >> USB_HCSPARAMS_PI_SHIFT)

/*
 * N_CC (RO)
 *
 * N_CC
 * Number of Companion Controller (N_CC).
 * This field indicates the number of companion controllers associated with this USB2.0 host controller.
 * These bits are '0000b' in all controller core.
 * 0000 - There is no internal Companion Controller and port-ownership hand-off is not supported.
 * 0001 - There are internal companion controller(s) and port-ownership hand-offs is supported.
 */
#define USB_HCSPARAMS_N_CC_MASK (0xF000U)
#define USB_HCSPARAMS_N_CC_SHIFT (12U)
#define USB_HCSPARAMS_N_CC_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_N_CC_MASK) >> USB_HCSPARAMS_N_CC_SHIFT)

/*
 * N_PCC (RO)
 *
 * N_PCC
 * Number of Ports per Companion Controller
 * This field indicates the number of ports supported per internal Companion Controller. It is used to indicate
 * the port routing configuration to the system software.
 * For example, if N_PORTS has a value of 6 and N_CC has a value of 2 then N_PCC could have a value
 * of 3. The convention is that the first N_PCC ports are assumed to be routed to companion controller 1,
 * the next N_PCC ports to companion controller 2, etc. In the previous example, the N_PCC could have
 * been 4, where the first 4 are routed to companion controller 1 and the last two are routed to companion
 * controller 2. The number in this field must be consistent with N_PORTS and N_CC.
 * These bits are '0000b' in all controller core.
 */
#define USB_HCSPARAMS_N_PCC_MASK (0xF00U)
#define USB_HCSPARAMS_N_PCC_SHIFT (8U)
#define USB_HCSPARAMS_N_PCC_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_N_PCC_MASK) >> USB_HCSPARAMS_N_PCC_SHIFT)

/*
 * PPC (RO)
 *
 * PPC
 * Port Power Control
 * This field indicates whether the host controller implementation includes port power control. A one
 * indicates the ports have port power switches. A zero indicates the ports do not have port power switches.
 * The value of this field affects the functionality of the Port Power field in each port status and control
 * Register
 */
#define USB_HCSPARAMS_PPC_MASK (0x10U)
#define USB_HCSPARAMS_PPC_SHIFT (4U)
#define USB_HCSPARAMS_PPC_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_PPC_MASK) >> USB_HCSPARAMS_PPC_SHIFT)

/*
 * N_PORTS (RO)
 *
 * N_PORTS
 * Number of downstream ports. This field specifies the number of physical downstream ports implemented
 * on this host controller. The value of this field determines how many port registers are addressable in the
 * Operational Register.
 * Valid values are in the range of 1h to Fh. A zero in this field is undefined.
 * These bits are always set to '0001b' because all controller cores are Single-Port Host.
 */
#define USB_HCSPARAMS_N_PORTS_MASK (0xFU)
#define USB_HCSPARAMS_N_PORTS_SHIFT (0U)
#define USB_HCSPARAMS_N_PORTS_GET(x) (((uint32_t)(x) & USB_HCSPARAMS_N_PORTS_MASK) >> USB_HCSPARAMS_N_PORTS_SHIFT)

/* Bitfield definition for register: HCCPARAMS */
/*
 * EECP (RO)
 *
 * EECP
 * EHCI Extended Capabilities Pointer.
 * This field indicates the existence of a capabilities list. A value of 00h indicates no extended capabilities
 * are implemented. A non-zero value in this register indicates the offset in PCI configuration space of the
 * first EHCI extended capability. The pointer value must be 40h or greater if implemented to maintain the
 * consistency of the PCI header defined for this class of device.
 * NOTE: These bits are set '00h' in all controller core.
 */
#define USB_HCCPARAMS_EECP_MASK (0xFF00U)
#define USB_HCCPARAMS_EECP_SHIFT (8U)
#define USB_HCCPARAMS_EECP_GET(x) (((uint32_t)(x) & USB_HCCPARAMS_EECP_MASK) >> USB_HCCPARAMS_EECP_SHIFT)

/*
 * IST (RO)
 *
 * IST
 * Isochronous Scheduling Threshold.
 * This field indicates, relative to the current position of the executing host controller, where software can
 * reliably update the isochronous schedule. When bit [7] is zero, the value of the least significant 3 bits
 * indicates the number of micro-frames a host controller can hold a set of isochronous data structures (one
 * or more) before flushing the state. When bit [7] is a one, then host software assumes the host controller
 * may cache an isochronous data structure for an entire frame.
 * These bits are set '00h' in all controller core.
 */
#define USB_HCCPARAMS_IST_MASK (0xF0U)
#define USB_HCCPARAMS_IST_SHIFT (4U)
#define USB_HCCPARAMS_IST_GET(x) (((uint32_t)(x) & USB_HCCPARAMS_IST_MASK) >> USB_HCCPARAMS_IST_SHIFT)

/*
 * ASP (RO)
 *
 * ASP
 * Asynchronous Schedule Park Capability
 * If this bit is set to a one, then the host controller supports the park feature for high-speed queue heads in
 * the Asynchronous Schedule. The feature can be disabled or enabled and set to a specific level by using
 * the Asynchronous Schedule Park Mode Enable and Asynchronous Schedule Park Mode Count fields in
 * the USBCMD register.
 * NOTE: ASP bit reset value: '00b' for OTG controller core, '11b' for Host-only controller core.
 */
#define USB_HCCPARAMS_ASP_MASK (0x4U)
#define USB_HCCPARAMS_ASP_SHIFT (2U)
#define USB_HCCPARAMS_ASP_GET(x) (((uint32_t)(x) & USB_HCCPARAMS_ASP_MASK) >> USB_HCCPARAMS_ASP_SHIFT)

