hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * PFL (RO)
 *
 * Programmable Frame List Flag
 * If this bit is set to zero, then the system software must use a frame list length of 1024 elements with this
 * host controller. The USBCMD register Frame List Size field is a read-only register and must be set to
 * zero.
 * If set to a one, then the system software can specify and use a smaller frame list and configure the host
 * controller via the USBCMD register Frame List Size field. The frame list must always be aligned on a 4Kpage
 * boundary. This requirement ensures that the frame list is always physically contiguous.
 * This bit is set '1b' in all controller core.
 */
#define USB_HCCPARAMS_PFL_MASK (0x2U)
#define USB_HCCPARAMS_PFL_SHIFT (1U)
#define USB_HCCPARAMS_PFL_GET(x) (((uint32_t)(x) & USB_HCCPARAMS_PFL_MASK) >> USB_HCCPARAMS_PFL_SHIFT)

/*
 * ADC (RO)
 *
 * ADC
 * 64-bit Addressing Capability
 * This bit is set '0b' in all controller core, no 64-bit addressing capability is supported.
 */
#define USB_HCCPARAMS_ADC_MASK (0x1U)
#define USB_HCCPARAMS_ADC_SHIFT (0U)
#define USB_HCCPARAMS_ADC_GET(x) (((uint32_t)(x) & USB_HCCPARAMS_ADC_MASK) >> USB_HCCPARAMS_ADC_SHIFT)

/* Bitfield definition for register: DCIVERSION */
/*
 * DCIVERSION (RO)
 *
 * DCIVERSION
 * Device Controller Interface Version Number
 * Default value is '01h', which means rev0.1.
 */
#define USB_DCIVERSION_DCIVERSION_MASK (0xFFFFU)
#define USB_DCIVERSION_DCIVERSION_SHIFT (0U)
#define USB_DCIVERSION_DCIVERSION_GET(x) (((uint16_t)(x) & USB_DCIVERSION_DCIVERSION_MASK) >> USB_DCIVERSION_DCIVERSION_SHIFT)

/* Bitfield definition for register: DCCPARAMS */
/*
 * HC (RO)
 *
 * HC
 * Host Capable
 * When this bit is 1, this controller is capable of operating as an EHCI compatible USB 2.0 host controller.
 */
#define USB_DCCPARAMS_HC_MASK (0x100U)
#define USB_DCCPARAMS_HC_SHIFT (8U)
#define USB_DCCPARAMS_HC_GET(x) (((uint32_t)(x) & USB_DCCPARAMS_HC_MASK) >> USB_DCCPARAMS_HC_SHIFT)

/*
 * DC (RO)
 *
 * DC
 * Device Capable
 * When this bit is 1, this controller is capable of operating as a USB 2.0 device.
 */
#define USB_DCCPARAMS_DC_MASK (0x80U)
#define USB_DCCPARAMS_DC_SHIFT (7U)
#define USB_DCCPARAMS_DC_GET(x) (((uint32_t)(x) & USB_DCCPARAMS_DC_MASK) >> USB_DCCPARAMS_DC_SHIFT)

/*
 * DEN (RO)
 *
 * DEN
 * Device Endpoint Number
 * This field indicates the number of endpoints built into the device controller. If this controller is not device
 * capable, then this field will be zero. Valid values are 0 - 15.
 */
#define USB_DCCPARAMS_DEN_MASK (0x1FU)
#define USB_DCCPARAMS_DEN_SHIFT (0U)
#define USB_DCCPARAMS_DEN_GET(x) (((uint32_t)(x) & USB_DCCPARAMS_DEN_MASK) >> USB_DCCPARAMS_DEN_SHIFT)

/* Bitfield definition for register: USBCMD */
/*
 * ITC (RW)
 *
 * ITC
 * Interrupt Threshold Control -Read/Write.
 * The system software uses this field to set the maximum rate at which the host/device controller will issue
 * interrupts. ITC contains the maximum interrupt interval measured in micro-frames. Valid values are
 * shown below.
 * Value Maximum Interrupt Interval
 * 00000000 - Immediate (no threshold)
 * 00000001 - 1 micro-frame
 * 00000010 - 2 micro-frames
 * 00000100 - 4 micro-frames
 * 00001000 - 8 micro-frames
 * 00010000 - 16 micro-frames
 * 00100000 - 32 micro-frames
 * 01000000 - 64 micro-frames
 */
#define USB_USBCMD_ITC_MASK (0xFF0000UL)
#define USB_USBCMD_ITC_SHIFT (16U)
#define USB_USBCMD_ITC_SET(x) (((uint32_t)(x) << USB_USBCMD_ITC_SHIFT) & USB_USBCMD_ITC_MASK)
#define USB_USBCMD_ITC_GET(x) (((uint32_t)(x) & USB_USBCMD_ITC_MASK) >> USB_USBCMD_ITC_SHIFT)

/*
 * FS_2 (RW)
 *
 * FS_2
 * Frame List Size - (Read/Write or Read Only). [host mode only]
 * This field is Read/Write only if Programmable Frame List Flag in the HCCPARAMS registers is set to one.
 * This field specifies the size of the frame list that controls which bits in the Frame Index Register should be
 * used for the Frame List Current index.
 * NOTE: This field is made up from USBCMD bits 15, 3 and 2.
 * Value Meaning
 * 0b000 - 1024 elements (4096 bytes) Default value
 * 0b001 - 512 elements (2048 bytes)
 * 0b010 - 256 elements (1024 bytes)
 * 0b011 - 128 elements (512 bytes)
 * 0b100 - 64 elements (256 bytes)
 * 0b101 - 32 elements (128 bytes)
 * 0b110 - 16 elements (64 bytes)
 * 0b111 - 8 elements (32 bytes)
 */
#define USB_USBCMD_FS_2_MASK (0x8000U)
#define USB_USBCMD_FS_2_SHIFT (15U)
#define USB_USBCMD_FS_2_SET(x) (((uint32_t)(x) << USB_USBCMD_FS_2_SHIFT) & USB_USBCMD_FS_2_MASK)
#define USB_USBCMD_FS_2_GET(x) (((uint32_t)(x) & USB_USBCMD_FS_2_MASK) >> USB_USBCMD_FS_2_SHIFT)

/*
 * ATDTW (RW)
 *
 * ATDTW
 * Add dTD TripWire - Read/Write. [device mode only]
 * This bit is used as a semaphore to ensure proper addition of a new dTD to an active (primed) endpoint's
 * linked list. This bit is set and cleared by software.
 * This bit would also be cleared by hardware when state machine is hazard region for which adding a dTD
 * to a primed endpoint may go unrecognized.
 */
#define USB_USBCMD_ATDTW_MASK (0x4000U)
#define USB_USBCMD_ATDTW_SHIFT (14U)
#define USB_USBCMD_ATDTW_SET(x) (((uint32_t)(x) << USB_USBCMD_ATDTW_SHIFT) & USB_USBCMD_ATDTW_MASK)
#define USB_USBCMD_ATDTW_GET(x) (((uint32_t)(x) & USB_USBCMD_ATDTW_MASK) >> USB_USBCMD_ATDTW_SHIFT)

/*
 * SUTW (RW)
 *
 * SUTW
 * Setup TripWire - Read/Write. [device mode only]
 * This bit is used as a semaphore to ensure that the setup data payload of 8 bytes is extracted from a QH
 * by the DCD without being corrupted. If the setup lockout mode is off (SLOM bit in USB core register
 * n_USBMODE, see USBMODE ) then there is a hazard when new setup data arrives while the DCD is
 * copying the setup data payload from the QH for a previous setup packet. This bit is set and cleared by
 * software.
 * This bit would also be cleared by hardware when a hazard detected.
 */
#define USB_USBCMD_SUTW_MASK (0x2000U)
#define USB_USBCMD_SUTW_SHIFT (13U)
#define USB_USBCMD_SUTW_SET(x) (((uint32_t)(x) << USB_USBCMD_SUTW_SHIFT) & USB_USBCMD_SUTW_MASK)
#define USB_USBCMD_SUTW_GET(x) (((uint32_t)(x) & USB_USBCMD_SUTW_MASK) >> USB_USBCMD_SUTW_SHIFT)

