hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * ASPE (RW)
 *
 * ASPE
 * Asynchronous Schedule Park Mode Enable - Read/Write.
 * If the Asynchronous Park Capability bit in the HCCPARAMS register is a one, then this bit defaults to a
 * 1h and is R/W. Otherwise the bit must be a zero and is RO. Software uses this bit to enable or disable
 * Park mode. When this bit is one, Park mode is enabled. When this bit is a zero, Park mode is disabled.
 * NOTE: ASPE bit reset value: '0b' for OTG controller .
 */
#define USB_USBCMD_ASPE_MASK (0x800U)
#define USB_USBCMD_ASPE_SHIFT (11U)
#define USB_USBCMD_ASPE_SET(x) (((uint32_t)(x) << USB_USBCMD_ASPE_SHIFT) & USB_USBCMD_ASPE_MASK)
#define USB_USBCMD_ASPE_GET(x) (((uint32_t)(x) & USB_USBCMD_ASPE_MASK) >> USB_USBCMD_ASPE_SHIFT)

/*
 * ASP (RW)
 *
 * ASP
 * Asynchronous Schedule Park Mode Count - Read/Write.
 * If the Asynchronous Park Capability bit in the HCCPARAMS register is a one, then this field defaults to
 * 3h and is R/W. Otherwise it defaults to zero and is Read-Only. It contains a count of the number of
 * successive transactions the host controller is allowed to execute from a high-speed queue head on the
 * Asynchronous schedule before continuing traversal of the Asynchronous schedule. Valid values are 1h to
 * 3h. Software must not write a zero to this bit when Park Mode Enable is a one as this will result in
 * undefined behavior.
 * This field is set to 3h in all controller core.
 */
#define USB_USBCMD_ASP_MASK (0x300U)
#define USB_USBCMD_ASP_SHIFT (8U)
#define USB_USBCMD_ASP_SET(x) (((uint32_t)(x) << USB_USBCMD_ASP_SHIFT) & USB_USBCMD_ASP_MASK)
#define USB_USBCMD_ASP_GET(x) (((uint32_t)(x) & USB_USBCMD_ASP_MASK) >> USB_USBCMD_ASP_SHIFT)

/*
 * IAA (RW)
 *
 * IAA
 * Interrupt on Async Advance Doorbell - Read/Write.
 * This bit is used as a doorbell by software to tell the host controller to issue an interrupt the next time it
 * advances asynchronous schedule. Software must write a 1 to this bit to ring the doorbell.
 * When the host controller has evicted all appropriate cached schedule states, it sets the Interrupt on
 * Async Advance status bit in the USBSTS register. If the Interrupt on Sync Advance Enable bit in the
 * USBINTR register is one, then the host controller will assert an interrupt at the next interrupt threshold.
 * The host controller sets this bit to zero after it has set the Interrupt on Sync Advance status bit in the
 * USBSTS register to one. Software should not write a one to this bit when the asynchronous schedule is
 * inactive. Doing so will yield undefined results.
 * This bit is only used in host mode. Writing a one to this bit when device mode is selected will have
 * undefined results.
 */
#define USB_USBCMD_IAA_MASK (0x40U)
#define USB_USBCMD_IAA_SHIFT (6U)
#define USB_USBCMD_IAA_SET(x) (((uint32_t)(x) << USB_USBCMD_IAA_SHIFT) & USB_USBCMD_IAA_MASK)
#define USB_USBCMD_IAA_GET(x) (((uint32_t)(x) & USB_USBCMD_IAA_MASK) >> USB_USBCMD_IAA_SHIFT)

/*
 * ASE (RW)
 *
 * ASE
 * Asynchronous Schedule Enable - Read/Write. Default 0b.
 * This bit controls whether the host controller skips processing the Asynchronous Schedule.
 * Only the host controller uses this bit.
 * Values Meaning
 * 0 - Do not process the Asynchronous Schedule.
 * 1 - Use the ASYNCLISTADDR register to access the Asynchronous Schedule.
 */
#define USB_USBCMD_ASE_MASK (0x20U)
#define USB_USBCMD_ASE_SHIFT (5U)
#define USB_USBCMD_ASE_SET(x) (((uint32_t)(x) << USB_USBCMD_ASE_SHIFT) & USB_USBCMD_ASE_MASK)
#define USB_USBCMD_ASE_GET(x) (((uint32_t)(x) & USB_USBCMD_ASE_MASK) >> USB_USBCMD_ASE_SHIFT)

/*
 * PSE (RW)
 *
 * PSE
 * Periodic Schedule Enable- Read/Write. Default 0b.
 * This bit controls whether the host controller skips processing the Periodic Schedule.
 * Only the host controller uses this bit.
 * Values Meaning
 * 0 - Do not process the Periodic Schedule
 * 1 - Use the PERIODICLISTBASE register to access the Periodic Schedule.
 */
#define USB_USBCMD_PSE_MASK (0x10U)
#define USB_USBCMD_PSE_SHIFT (4U)
#define USB_USBCMD_PSE_SET(x) (((uint32_t)(x) << USB_USBCMD_PSE_SHIFT) & USB_USBCMD_PSE_MASK)
#define USB_USBCMD_PSE_GET(x) (((uint32_t)(x) & USB_USBCMD_PSE_MASK) >> USB_USBCMD_PSE_SHIFT)

/*
 * FS_1 (RW)
 *
 * FS_1
 * See description at bit 15
 */
#define USB_USBCMD_FS_1_MASK (0xCU)
#define USB_USBCMD_FS_1_SHIFT (2U)
#define USB_USBCMD_FS_1_SET(x) (((uint32_t)(x) << USB_USBCMD_FS_1_SHIFT) & USB_USBCMD_FS_1_MASK)
#define USB_USBCMD_FS_1_GET(x) (((uint32_t)(x) & USB_USBCMD_FS_1_MASK) >> USB_USBCMD_FS_1_SHIFT)

/*
 * RST (RW)
 *
 * RST
 * Controller Reset (RESET) - Read/Write. Software uses this bit to reset the controller. This bit is set to
 * zero by the Host/Device Controller when the reset process is complete. Software cannot terminate the
 * reset process early by writing a zero to this register.
 * Host operation mode:
 * When software writes a one to this bit, the Controller resets its internal pipelines, timers, counters, state
 * machines etc. to their initial value. Any transaction currently in progress on USB is immediately
 * terminated. A USB reset is not driven on downstream ports. Software should not set this bit to a one
 * when the HCHalted bit in the USBSTS register is a zero. Attempting to reset an actively running host
 * controller will result in undefined behavior.
 * Device operation mode:
 * When software writes a one to this bit, the Controller resets its internal pipelines, timers, counters, state
 * machines etc. to their initial value. Writing a one to this bit when the device is in the attached state is not
 * recommended, because the effect on an attached host is undefined. In order to ensure that the device is
 * not in an attached state before initiating a device controller reset, all primed endpoints should be flushed
 * and the USBCMD Run/Stop bit should be set to 0.
 */
#define USB_USBCMD_RST_MASK (0x2U)
#define USB_USBCMD_RST_SHIFT (1U)
#define USB_USBCMD_RST_SET(x) (((uint32_t)(x) << USB_USBCMD_RST_SHIFT) & USB_USBCMD_RST_MASK)
#define USB_USBCMD_RST_GET(x) (((uint32_t)(x) & USB_USBCMD_RST_MASK) >> USB_USBCMD_RST_SHIFT)

