hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * RS (RW)
 *
 * RS
 * Run/Stop (RS) - Read/Write. Default 0b. 1=Run. 0=Stop.
 * Host operation mode:
 * When set to '1b', the Controller proceeds with the execution of the schedule. The Controller continues
 * execution as long as this bit is set to a one. When this bit is set to 0, the Host Controller completes the
 * current transaction on the USB and then halts. The HC Halted bit in the status register indicates when the
 * Controller has finished the transaction and has entered the stopped state. Software should not write a
 * one to this field unless the controller is in the Halted state (that is, HCHalted in the USBSTS register is a
 * one).
 * Device operation mode:
 * Writing a one to this bit will cause the controller to enable a pull-up on D+ and initiate an attach event.
 * This control bit is not directly connected to the pull-up enable, as the pull-up will become disabled upon
 * transitioning into high-speed mode. Software should use this bit to prevent an attach event before the
 * controller has been properly initialized. Writing a 0 to this will cause a detach event.
 */
#define USB_USBCMD_RS_MASK (0x1U)
#define USB_USBCMD_RS_SHIFT (0U)
#define USB_USBCMD_RS_SET(x) (((uint32_t)(x) << USB_USBCMD_RS_SHIFT) & USB_USBCMD_RS_MASK)
#define USB_USBCMD_RS_GET(x) (((uint32_t)(x) & USB_USBCMD_RS_MASK) >> USB_USBCMD_RS_SHIFT)

/* Bitfield definition for register: USBSTS */
/*
 * TI1 (RWC)
 *
 * TI1
 * General Purpose Timer Interrupt 1(GPTINT1)--R/WC.
 * This bit is set when the counter in the GPTIMER1CTRL register transitions to zero, writing a one to this
 * bit will clear it.
 */
#define USB_USBSTS_TI1_MASK (0x2000000UL)
#define USB_USBSTS_TI1_SHIFT (25U)
#define USB_USBSTS_TI1_SET(x) (((uint32_t)(x) << USB_USBSTS_TI1_SHIFT) & USB_USBSTS_TI1_MASK)
#define USB_USBSTS_TI1_GET(x) (((uint32_t)(x) & USB_USBSTS_TI1_MASK) >> USB_USBSTS_TI1_SHIFT)

/*
 * TI0 (RWC)
 *
 * TI0
 * General Purpose Timer Interrupt 0(GPTINT0)--R/WC.
 * This bit is set when the counter in the GPTIMER0CTRL register transitions to zero, writing a one to this
 * bit clears it.
 */
#define USB_USBSTS_TI0_MASK (0x1000000UL)
#define USB_USBSTS_TI0_SHIFT (24U)
#define USB_USBSTS_TI0_SET(x) (((uint32_t)(x) << USB_USBSTS_TI0_SHIFT) & USB_USBSTS_TI0_MASK)
#define USB_USBSTS_TI0_GET(x) (((uint32_t)(x) & USB_USBSTS_TI0_MASK) >> USB_USBSTS_TI0_SHIFT)

/*
 * NAKI (RO)
 *
 * NAKI
 * NAK Interrupt Bit--RO.
 * This bit is set by hardware when for a particular endpoint both the TX/RX Endpoint NAK bit and
 * corresponding TX/RX Endpoint NAK Enable bit are set. This bit is automatically cleared by hardware
 * when all Enabled TX/RX Endpoint NAK bits are cleared.
 */
#define USB_USBSTS_NAKI_MASK (0x10000UL)
#define USB_USBSTS_NAKI_SHIFT (16U)
#define USB_USBSTS_NAKI_GET(x) (((uint32_t)(x) & USB_USBSTS_NAKI_MASK) >> USB_USBSTS_NAKI_SHIFT)

/*
 * AS (RO)
 *
 * AS
 * Asynchronous Schedule Status - Read Only.
 * This bit reports the current real status of the Asynchronous Schedule. When set to zero the asynchronous
 * schedule status is disabled and if set to one the status is enabled. The Host Controller is not required to
 * immediately disable or enable the Asynchronous Schedule when software transitions the Asynchronous
 * Schedule Enable bit in the USBCMD register. When this bit and the Asynchronous Schedule Enable bit
 * are the same value, the Asynchronous Schedule is either enabled (1) or disabled (0).
 * Only used in the host operation mode.
 */
#define USB_USBSTS_AS_MASK (0x8000U)
#define USB_USBSTS_AS_SHIFT (15U)
#define USB_USBSTS_AS_GET(x) (((uint32_t)(x) & USB_USBSTS_AS_MASK) >> USB_USBSTS_AS_SHIFT)

/*
 * PS (RO)
 *
 * PS
 * Periodic Schedule Status - Read Only.
 * This bit reports the current real status of the Periodic Schedule. When set to zero the periodic schedule is
 * disabled, and if set to one the status is enabled. The Host Controller is not required to immediately
 * disable or enable the Periodic Schedule when software transitions the Periodic Schedule Enable bit in the
 * USBCMD register. When this bit and the Periodic Schedule Enable bit are the same value, the Periodic
 * Schedule is either enabled (1) or disabled (0).
 * Only used in the host operation mode.
 */
#define USB_USBSTS_PS_MASK (0x4000U)
#define USB_USBSTS_PS_SHIFT (14U)
#define USB_USBSTS_PS_GET(x) (((uint32_t)(x) & USB_USBSTS_PS_MASK) >> USB_USBSTS_PS_SHIFT)

/*
 * RCL (RO)
 *
 * RCL
 * Reclamation - Read Only.
 * This is a read-only status bit used to detect an empty asynchronous schedule.
 * Only used in the host operation mode.
 */
#define USB_USBSTS_RCL_MASK (0x2000U)
#define USB_USBSTS_RCL_SHIFT (13U)
#define USB_USBSTS_RCL_GET(x) (((uint32_t)(x) & USB_USBSTS_RCL_MASK) >> USB_USBSTS_RCL_SHIFT)

/*
 * HCH (RO)
 *
 * HCH
 * HCHaIted - Read Only.
 * This bit is a zero whenever the Run/Stop bit is a one. The Controller sets this bit to one after it has
 * stopped executing because of the Run/Stop bit being set to 0, either by software or by the Controller
 * hardware (for example, an internal error).
 * Only used in the host operation mode.
 * Default value is '0b' for OTG core .
 * This is because OTG core is not operating as host in default. Please see CM bit in USB_n_USBMODE
 * register.
 * NOTE: HCH bit reset value: '0b' for OTG controller core .
 */
#define USB_USBSTS_HCH_MASK (0x1000U)
#define USB_USBSTS_HCH_SHIFT (12U)
#define USB_USBSTS_HCH_GET(x) (((uint32_t)(x) & USB_USBSTS_HCH_MASK) >> USB_USBSTS_HCH_SHIFT)

/*
 * ULPII (RWC)
 *
 * ULPII
 * ULPI Interrupt - R/WC.
 * This bit will be set '1b' by hardware when there is an event completion in ULPI viewport.
 * This bit is usable only if the controller support UPLI interface mode.
 */
#define USB_USBSTS_ULPII_MASK (0x400U)
#define USB_USBSTS_ULPII_SHIFT (10U)
#define USB_USBSTS_ULPII_SET(x) (((uint32_t)(x) << USB_USBSTS_ULPII_SHIFT) & USB_USBSTS_ULPII_MASK)
#define USB_USBSTS_ULPII_GET(x) (((uint32_t)(x) & USB_USBSTS_ULPII_MASK) >> USB_USBSTS_ULPII_SHIFT)

/*
 * SLI (RWC)
 *
 * SLI
 * DCSuspend - R/WC.
 * When a controller enters a suspend state from an active state, this bit will be set to a one. The device
 * controller clears the bit upon exiting from a suspend state.
 * Only used in device operation mode.
 */
#define USB_USBSTS_SLI_MASK (0x100U)
#define USB_USBSTS_SLI_SHIFT (8U)
#define USB_USBSTS_SLI_SET(x) (((uint32_t)(x) << USB_USBSTS_SLI_SHIFT) & USB_USBSTS_SLI_MASK)
#define USB_USBSTS_SLI_GET(x) (((uint32_t)(x) & USB_USBSTS_SLI_MASK) >> USB_USBSTS_SLI_SHIFT)

