hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * SRI (RWC)
 *
 * SRI
 * SOF Received - R/WC.
 * When the device controller detects a Start Of (micro) Frame, this bit will be set to a one. When a SOF is
 * extremely late, the device controller will automatically set this bit to indicate that an SOF was expected.
 * Therefore, this bit will be set roughly every 1ms in device FS mode and every 125ms in HS mode and will
 * be synchronized to the actual SOF that is received.
 * Because the device controller is initialized to FS before connect, this bit will be set at an interval of 1ms
 * during the prelude to connect and chirp.
 * In host mode, this bit will be set every 125us and can be used by host controller driver as a time base.
 * Software writes a 1 to this bit to clear it.
 */
#define USB_USBSTS_SRI_MASK (0x80U)
#define USB_USBSTS_SRI_SHIFT (7U)
#define USB_USBSTS_SRI_SET(x) (((uint32_t)(x) << USB_USBSTS_SRI_SHIFT) & USB_USBSTS_SRI_MASK)
#define USB_USBSTS_SRI_GET(x) (((uint32_t)(x) & USB_USBSTS_SRI_MASK) >> USB_USBSTS_SRI_SHIFT)

/*
 * URI (RWC)
 *
 * URI
 * USB Reset Received - R/WC.
 * When the device controller detects a USB Reset and enters the default state, this bit will be set to a one.
 * Software can write a 1 to this bit to clear the USB Reset Received status bit.
 * Only used in device operation mode.
 */
#define USB_USBSTS_URI_MASK (0x40U)
#define USB_USBSTS_URI_SHIFT (6U)
#define USB_USBSTS_URI_SET(x) (((uint32_t)(x) << USB_USBSTS_URI_SHIFT) & USB_USBSTS_URI_MASK)
#define USB_USBSTS_URI_GET(x) (((uint32_t)(x) & USB_USBSTS_URI_MASK) >> USB_USBSTS_URI_SHIFT)

/*
 * AAI (RWC)
 *
 * AAI
 * Interrupt on Async Advance - R/WC.
 * System software can force the host controller to issue an interrupt the next time the host controller
 * advances the asynchronous schedule by writing a one to the Interrupt on Async Advance Doorbell bit in
 * the n_USBCMD register. This status bit indicates the assertion of that interrupt source.
 * Only used in host operation mode.
 */
#define USB_USBSTS_AAI_MASK (0x20U)
#define USB_USBSTS_AAI_SHIFT (5U)
#define USB_USBSTS_AAI_SET(x) (((uint32_t)(x) << USB_USBSTS_AAI_SHIFT) & USB_USBSTS_AAI_MASK)
#define USB_USBSTS_AAI_GET(x) (((uint32_t)(x) & USB_USBSTS_AAI_MASK) >> USB_USBSTS_AAI_SHIFT)

/*
 * SEI (RWC)
 *
 * FRI
 * Frame List Rollover - R/WC.
 * The Host Controller sets this bit to a one when the Frame List Index rolls over from its maximum value to
 * zero. The exact value at which the rollover occurs depends on the frame list size. For example. If the
 * frame list size (as programmed in the Frame List Size field of the USB_n_USBCMD register) is 1024, the
 * Frame Index Register rolls over every time FRINDEX [13] toggles. Similarly, if the size is 512, the Host
 * Controller sets this bit to a one every time FHINDEX [12] toggles.
 * Only used in host operation mode.
 */
#define USB_USBSTS_SEI_MASK (0x10U)
#define USB_USBSTS_SEI_SHIFT (4U)
#define USB_USBSTS_SEI_SET(x) (((uint32_t)(x) << USB_USBSTS_SEI_SHIFT) & USB_USBSTS_SEI_MASK)
#define USB_USBSTS_SEI_GET(x) (((uint32_t)(x) & USB_USBSTS_SEI_MASK) >> USB_USBSTS_SEI_SHIFT)

/*
 * FRI (RWC)
 *
 * FRI
 * Frame List Rollover - R/WC.
 * The Host Controller sets this bit to a one when the Frame List Index rolls over from its maximum value to
 * zero. The exact value at which the rollover occurs depends on the frame list size. For example. If the
 * frame list size (as programmed in the Frame List Size field of the USB_n_USBCMD register) is 1024, the
 * Frame Index Register rolls over every time FRINDEX [13] toggles. Similarly, if the size is 512, the Host
 * Controller sets this bit to a one every time FHINDEX [12] toggles.
 * Only used in host operation mode.
 */
#define USB_USBSTS_FRI_MASK (0x8U)
#define USB_USBSTS_FRI_SHIFT (3U)
#define USB_USBSTS_FRI_SET(x) (((uint32_t)(x) << USB_USBSTS_FRI_SHIFT) & USB_USBSTS_FRI_MASK)
#define USB_USBSTS_FRI_GET(x) (((uint32_t)(x) & USB_USBSTS_FRI_MASK) >> USB_USBSTS_FRI_SHIFT)

/*
 * PCI (RWC)
 *
 * PCI
 * Port Change Detect - R/WC.
 * The Host Controller sets this bit to a one when on any port a Connect Status occurs, a Port Enable/
 * Disable Change occurs, or the Force Port Resume bit is set as the result of a J-K transition on the
 * suspended port.
 * The Device Controller sets this bit to a one when the port controller enters the full or high-speed
 * operational state. When the port controller exits the full or high-speed operation states due to Reset or
 * Suspend events, the notification mechanisms are the USB Reset Received bit and the DCSuspend bits
 * Respectively.
 */
#define USB_USBSTS_PCI_MASK (0x4U)
#define USB_USBSTS_PCI_SHIFT (2U)
#define USB_USBSTS_PCI_SET(x) (((uint32_t)(x) << USB_USBSTS_PCI_SHIFT) & USB_USBSTS_PCI_MASK)
#define USB_USBSTS_PCI_GET(x) (((uint32_t)(x) & USB_USBSTS_PCI_MASK) >> USB_USBSTS_PCI_SHIFT)

/*
 * UEI (RWC)
 *
 * UEI
 * USB Error Interrupt (USBERRINT) - R/WC.
 * When completion of a USB transaction results in an error condition, this bit is set by the Host/Device
 * Controller. This bit is set along with the USBINT bit, if the TD on which the error interrupt occurred also
 * had its interrupt on complete (IOC) bit set.
 * The device controller detects resume signaling only.
 */
#define USB_USBSTS_UEI_MASK (0x2U)
#define USB_USBSTS_UEI_SHIFT (1U)
#define USB_USBSTS_UEI_SET(x) (((uint32_t)(x) << USB_USBSTS_UEI_SHIFT) & USB_USBSTS_UEI_MASK)
#define USB_USBSTS_UEI_GET(x) (((uint32_t)(x) & USB_USBSTS_UEI_MASK) >> USB_USBSTS_UEI_SHIFT)

/*
 * UI (RWC)
 *
 * UI
 * USB Interrupt (USBINT) - R/WC.
 * This bit is set by the Host/Device Controller when the cause of an interrupt is a completion of a USB
 * transaction where the Transfer Descriptor (TD) has an interrupt on complete (IOC) bit set.
 * This bit is also set by the Host/Device Controller when a short packet is detected. A short packet is when
 * the actual number of bytes received was less than the expected number of bytes.
 */
#define USB_USBSTS_UI_MASK (0x1U)
#define USB_USBSTS_UI_SHIFT (0U)
#define USB_USBSTS_UI_SET(x) (((uint32_t)(x) << USB_USBSTS_UI_SHIFT) & USB_USBSTS_UI_MASK)
#define USB_USBSTS_UI_GET(x) (((uint32_t)(x) & USB_USBSTS_UI_MASK) >> USB_USBSTS_UI_SHIFT)

