hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/* Bitfield definition for register: USBINTR */
/*
 * TIE1 (RW)
 *
 * TIE1
 * General Purpose Timer #1 Interrupt Enable
 * When this bit is one and the TI1 bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_TIE1_MASK (0x2000000UL)
#define USB_USBINTR_TIE1_SHIFT (25U)
#define USB_USBINTR_TIE1_SET(x) (((uint32_t)(x) << USB_USBINTR_TIE1_SHIFT) & USB_USBINTR_TIE1_MASK)
#define USB_USBINTR_TIE1_GET(x) (((uint32_t)(x) & USB_USBINTR_TIE1_MASK) >> USB_USBINTR_TIE1_SHIFT)

/*
 * TIE0 (RW)
 *
 * TIE0
 * General Purpose Timer #0 Interrupt Enable
 * When this bit is one and the TI0 bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_TIE0_MASK (0x1000000UL)
#define USB_USBINTR_TIE0_SHIFT (24U)
#define USB_USBINTR_TIE0_SET(x) (((uint32_t)(x) << USB_USBINTR_TIE0_SHIFT) & USB_USBINTR_TIE0_MASK)
#define USB_USBINTR_TIE0_GET(x) (((uint32_t)(x) & USB_USBINTR_TIE0_MASK) >> USB_USBINTR_TIE0_SHIFT)

/*
 * UPIE (RW)
 *
 * UPIE
 * USB Host Periodic Interrupt Enable
 * When this bit is one, and the UPI bit in the n_USBSTS register is one, host controller will issue an
 * interrupt at the next interrupt threshold.
 */
#define USB_USBINTR_UPIE_MASK (0x80000UL)
#define USB_USBINTR_UPIE_SHIFT (19U)
#define USB_USBINTR_UPIE_SET(x) (((uint32_t)(x) << USB_USBINTR_UPIE_SHIFT) & USB_USBINTR_UPIE_MASK)
#define USB_USBINTR_UPIE_GET(x) (((uint32_t)(x) & USB_USBINTR_UPIE_MASK) >> USB_USBINTR_UPIE_SHIFT)

/*
 * UAIE (RW)
 *
 * UAIE
 * USB Host Asynchronous Interrupt Enable
 * When this bit is one, and the UAI bit in the n_USBSTS register is one, host controller will issue an
 * interrupt at the next interrupt threshold.
 */
#define USB_USBINTR_UAIE_MASK (0x40000UL)
#define USB_USBINTR_UAIE_SHIFT (18U)
#define USB_USBINTR_UAIE_SET(x) (((uint32_t)(x) << USB_USBINTR_UAIE_SHIFT) & USB_USBINTR_UAIE_MASK)
#define USB_USBINTR_UAIE_GET(x) (((uint32_t)(x) & USB_USBINTR_UAIE_MASK) >> USB_USBINTR_UAIE_SHIFT)

/*
 * NAKE (RO)
 *
 * NAKE
 * NAK Interrupt Enable
 * When this bit is one and the NAKI bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_NAKE_MASK (0x10000UL)
#define USB_USBINTR_NAKE_SHIFT (16U)
#define USB_USBINTR_NAKE_GET(x) (((uint32_t)(x) & USB_USBINTR_NAKE_MASK) >> USB_USBINTR_NAKE_SHIFT)

/*
 * ULPIE (RW)
 *
 * ULPIE
 * ULPI Interrupt Enable
 * When this bit is one and the UPLII bit in n_USBSTS register is a one the controller will issue an interrupt.
 * This bit is usable only if the controller support UPLI interface mode.
 */
#define USB_USBINTR_ULPIE_MASK (0x400U)
#define USB_USBINTR_ULPIE_SHIFT (10U)
#define USB_USBINTR_ULPIE_SET(x) (((uint32_t)(x) << USB_USBINTR_ULPIE_SHIFT) & USB_USBINTR_ULPIE_MASK)
#define USB_USBINTR_ULPIE_GET(x) (((uint32_t)(x) & USB_USBINTR_ULPIE_MASK) >> USB_USBINTR_ULPIE_SHIFT)

/*
 * SLE (RW)
 *
 * SLE
 * Sleep Interrupt Enable
 * When this bit is one and the SLI bit in n_n_USBSTS register is a one the controller will issue an interrupt.
 * Only used in device operation mode.
 */
#define USB_USBINTR_SLE_MASK (0x100U)
#define USB_USBINTR_SLE_SHIFT (8U)
#define USB_USBINTR_SLE_SET(x) (((uint32_t)(x) << USB_USBINTR_SLE_SHIFT) & USB_USBINTR_SLE_MASK)
#define USB_USBINTR_SLE_GET(x) (((uint32_t)(x) & USB_USBINTR_SLE_MASK) >> USB_USBINTR_SLE_SHIFT)

/*
 * SRE (RW)
 *
 * SRE
 * SOF Received Interrupt Enable
 * When this bit is one and the SRI bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_SRE_MASK (0x80U)
#define USB_USBINTR_SRE_SHIFT (7U)
#define USB_USBINTR_SRE_SET(x) (((uint32_t)(x) << USB_USBINTR_SRE_SHIFT) & USB_USBINTR_SRE_MASK)
#define USB_USBINTR_SRE_GET(x) (((uint32_t)(x) & USB_USBINTR_SRE_MASK) >> USB_USBINTR_SRE_SHIFT)

/*
 * URE (RW)
 *
 * URE
 * USB Reset Interrupt Enable
 * When this bit is one and the URI bit in n_USBSTS register is a one the controller will issue an interrupt.
 * Only used in device operation mode.
 */
#define USB_USBINTR_URE_MASK (0x40U)
#define USB_USBINTR_URE_SHIFT (6U)
#define USB_USBINTR_URE_SET(x) (((uint32_t)(x) << USB_USBINTR_URE_SHIFT) & USB_USBINTR_URE_MASK)
#define USB_USBINTR_URE_GET(x) (((uint32_t)(x) & USB_USBINTR_URE_MASK) >> USB_USBINTR_URE_SHIFT)

/*
 * AAE (RW)
 *
 * AAE
 * Async Advance Interrupt Enable
 * When this bit is one and the AAI bit in n_USBSTS register is a one the controller will issue an interrupt.
 * Only used in host operation mode.
 */
#define USB_USBINTR_AAE_MASK (0x20U)
#define USB_USBINTR_AAE_SHIFT (5U)
#define USB_USBINTR_AAE_SET(x) (((uint32_t)(x) << USB_USBINTR_AAE_SHIFT) & USB_USBINTR_AAE_MASK)
#define USB_USBINTR_AAE_GET(x) (((uint32_t)(x) & USB_USBINTR_AAE_MASK) >> USB_USBINTR_AAE_SHIFT)

/*
 * SEE (RW)
 *
 * SEE
 * System Error Interrupt Enable
 * When this bit is one and the SEI bit in n_USBSTS register is a one the controller will issue an interrupt.
 * Only used in host operation mode.
 */
#define USB_USBINTR_SEE_MASK (0x10U)
#define USB_USBINTR_SEE_SHIFT (4U)
#define USB_USBINTR_SEE_SET(x) (((uint32_t)(x) << USB_USBINTR_SEE_SHIFT) & USB_USBINTR_SEE_MASK)
#define USB_USBINTR_SEE_GET(x) (((uint32_t)(x) & USB_USBINTR_SEE_MASK) >> USB_USBINTR_SEE_SHIFT)

/*
 * FRE (RW)
 *
 * FRE
 * Frame List Rollover Interrupt Enable
 * When this bit is one and the FRI bit in n_USBSTS register is a one the controller will issue an interrupt.
 * Only used in host operation mode.
 */
#define USB_USBINTR_FRE_MASK (0x8U)
#define USB_USBINTR_FRE_SHIFT (3U)
#define USB_USBINTR_FRE_SET(x) (((uint32_t)(x) << USB_USBINTR_FRE_SHIFT) & USB_USBINTR_FRE_MASK)
#define USB_USBINTR_FRE_GET(x) (((uint32_t)(x) & USB_USBINTR_FRE_MASK) >> USB_USBINTR_FRE_SHIFT)

/*
 * PCE (RW)
 *
 * PCE
 * Port Change Detect Interrupt Enable
 * When this bit is one and the PCI bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_PCE_MASK (0x4U)
#define USB_USBINTR_PCE_SHIFT (2U)
#define USB_USBINTR_PCE_SET(x) (((uint32_t)(x) << USB_USBINTR_PCE_SHIFT) & USB_USBINTR_PCE_MASK)
#define USB_USBINTR_PCE_GET(x) (((uint32_t)(x) & USB_USBINTR_PCE_MASK) >> USB_USBINTR_PCE_SHIFT)

