hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * UEE (RWC)
 *
 * UEE
 * USB Error Interrupt Enable
 * When this bit is one and the UEI bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_UEE_MASK (0x2U)
#define USB_USBINTR_UEE_SHIFT (1U)
#define USB_USBINTR_UEE_SET(x) (((uint32_t)(x) << USB_USBINTR_UEE_SHIFT) & USB_USBINTR_UEE_MASK)
#define USB_USBINTR_UEE_GET(x) (((uint32_t)(x) & USB_USBINTR_UEE_MASK) >> USB_USBINTR_UEE_SHIFT)

/*
 * UE (RW)
 *
 * UE
 * USB Interrupt Enable
 * When this bit is one and the UI bit in n_USBSTS register is a one the controller will issue an interrupt.
 */
#define USB_USBINTR_UE_MASK (0x1U)
#define USB_USBINTR_UE_SHIFT (0U)
#define USB_USBINTR_UE_SET(x) (((uint32_t)(x) << USB_USBINTR_UE_SHIFT) & USB_USBINTR_UE_MASK)
#define USB_USBINTR_UE_GET(x) (((uint32_t)(x) & USB_USBINTR_UE_MASK) >> USB_USBINTR_UE_SHIFT)

/* Bitfield definition for register: FRINDEX */
/*
 * FRINDEX (RW)
 *
 * FRINDEX
 * Frame Index.
 * The value, in this register, increments at the end of each time frame (micro-frame). Bits [N: 3] are used for
 * the Frame List current index. This means that each location of the frame list is accessed 8 times (frames
 * or micro-frames) before moving to the next index.
 * The following illustrates values of N based on the value of the Frame List Size field in the USBCMD
 * register, when used in host mode.
 * USBCMD [Frame List Size] Number Elements N
 * In device mode the value is the current frame number of the last frame transmitted. It is not used as an
 * index.
 * In either mode bits 2:0 indicate the current microframe.
 * The bit field values description below is represented as (Frame List Size) Number Elements N.
 * 00000000000000 - (1024) 12
 * 00000000000001 - (512) 11
 * 00000000000010 - (256) 10
 * 00000000000011 - (128) 9
 * 00000000000100 - (64) 8
 * 00000000000101 - (32) 7
 * 00000000000110 - (16) 6
 * 00000000000111 - (8) 5
 */
#define USB_FRINDEX_FRINDEX_MASK (0x3FFFU)
#define USB_FRINDEX_FRINDEX_SHIFT (0U)
#define USB_FRINDEX_FRINDEX_SET(x) (((uint32_t)(x) << USB_FRINDEX_FRINDEX_SHIFT) & USB_FRINDEX_FRINDEX_MASK)
#define USB_FRINDEX_FRINDEX_GET(x) (((uint32_t)(x) & USB_FRINDEX_FRINDEX_MASK) >> USB_FRINDEX_FRINDEX_SHIFT)

/* Bitfield definition for register: DEVICEADDR */
/*
 * USBADR (RW)
 *
 * USBADR
 * Device Address.
 * These bits correspond to the USB device address
 */
#define USB_DEVICEADDR_USBADR_MASK (0xFE000000UL)
#define USB_DEVICEADDR_USBADR_SHIFT (25U)
#define USB_DEVICEADDR_USBADR_SET(x) (((uint32_t)(x) << USB_DEVICEADDR_USBADR_SHIFT) & USB_DEVICEADDR_USBADR_MASK)
#define USB_DEVICEADDR_USBADR_GET(x) (((uint32_t)(x) & USB_DEVICEADDR_USBADR_MASK) >> USB_DEVICEADDR_USBADR_SHIFT)

/*
 * USBADRA (RW)
 *
 * USBADRA
 * Device Address Advance. Default=0.
 * When this bit is '0', any writes to USBADR are instantaneous. When this bit is written to a '1' at the same
 * time or before USBADR is written, the write to the USBADR field is staged and held in a hidden register.
 * After an IN occurs on endpoint 0 and is ACKed, USBADR will be loaded from the holding register.
 * Hardware will automatically clear this bit on the following conditions:
 * 1) IN is ACKed to endpoint 0. (USBADR is updated from staging register).
 * 2) OUT/SETUP occur to endpoint 0. (USBADR is not updated).
 * 3) Device Reset occurs (USBADR is reset to 0).
 * NOTE: After the status phase of the SET_ADDRESS descriptor, the DCD has 2 ms to program the
 * USBADR field. This mechanism will ensure this specification is met when the DCD can not write
 * of the device address within 2ms from the SET_ADDRESS status phase. If the DCD writes the
 * USBADR with USBADRA=1 after the SET_ADDRESS data phase (before the prime of the
 * status phase), the USBADR will be programmed instantly at the correct time and meet the 2ms
 * USB requirement.
 */
#define USB_DEVICEADDR_USBADRA_MASK (0x1000000UL)
#define USB_DEVICEADDR_USBADRA_SHIFT (24U)
#define USB_DEVICEADDR_USBADRA_SET(x) (((uint32_t)(x) << USB_DEVICEADDR_USBADRA_SHIFT) & USB_DEVICEADDR_USBADRA_MASK)
#define USB_DEVICEADDR_USBADRA_GET(x) (((uint32_t)(x) & USB_DEVICEADDR_USBADRA_MASK) >> USB_DEVICEADDR_USBADRA_SHIFT)

/* Bitfield definition for register: PERIODICLISTBASE */
/*
 * BASEADR (RW)
 *
 * BASEADR
 * Base Address (Low).
 * These bits correspond to memory address signals [31:12], respectively.
 * Only used by the host controller.
 */
#define USB_PERIODICLISTBASE_BASEADR_MASK (0xFFFFF000UL)
#define USB_PERIODICLISTBASE_BASEADR_SHIFT (12U)
#define USB_PERIODICLISTBASE_BASEADR_SET(x) (((uint32_t)(x) << USB_PERIODICLISTBASE_BASEADR_SHIFT) & USB_PERIODICLISTBASE_BASEADR_MASK)
#define USB_PERIODICLISTBASE_BASEADR_GET(x) (((uint32_t)(x) & USB_PERIODICLISTBASE_BASEADR_MASK) >> USB_PERIODICLISTBASE_BASEADR_SHIFT)

/* Bitfield definition for register: ASYNCLISTADDR */
/*
 * ASYBASE (RW)
 *
 * ASYBASE
 * Link Pointer Low (LPL).
 * These bits correspond to memory address signals [31:5], respectively. This field may only reference a
 * Queue Head (QH).
 * Only used by the host controller.
 */
#define USB_ASYNCLISTADDR_ASYBASE_MASK (0xFFFFFFE0UL)
#define USB_ASYNCLISTADDR_ASYBASE_SHIFT (5U)
#define USB_ASYNCLISTADDR_ASYBASE_SET(x) (((uint32_t)(x) << USB_ASYNCLISTADDR_ASYBASE_SHIFT) & USB_ASYNCLISTADDR_ASYBASE_MASK)
#define USB_ASYNCLISTADDR_ASYBASE_GET(x) (((uint32_t)(x) & USB_ASYNCLISTADDR_ASYBASE_MASK) >> USB_ASYNCLISTADDR_ASYBASE_SHIFT)

/* Bitfield definition for register: ENDPTLISTADDR */
/*
 * EPBASE (RW)
 *
 * EPBASE
 * Endpoint List Pointer(Low). These bits correspond to memory address signals [31:11], respectively. This
 * field will reference a list of up to 32 Queue Head (QH) (that is, one queue head per endpoint & direction).
 */
#define USB_ENDPTLISTADDR_EPBASE_MASK (0xFFFFF800UL)
#define USB_ENDPTLISTADDR_EPBASE_SHIFT (11U)
#define USB_ENDPTLISTADDR_EPBASE_SET(x) (((uint32_t)(x) << USB_ENDPTLISTADDR_EPBASE_SHIFT) & USB_ENDPTLISTADDR_EPBASE_MASK)
#define USB_ENDPTLISTADDR_EPBASE_GET(x) (((uint32_t)(x) & USB_ENDPTLISTADDR_EPBASE_MASK) >> USB_ENDPTLISTADDR_EPBASE_SHIFT)

