hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/* Bitfield definition for register: BURSTSIZE */
/*
 * TXPBURST (RW)
 *
 * TXPBURST
 * Programmable TX Burst Size.
 * Default value is determined by TXBURST bits in n_HWTXBUF.
 * This register represents the maximum length of a the burst in 32-bit words while moving data from system
 * memory to the USB bus.
 */
#define USB_BURSTSIZE_TXPBURST_MASK (0xFF00U)
#define USB_BURSTSIZE_TXPBURST_SHIFT (8U)
#define USB_BURSTSIZE_TXPBURST_SET(x) (((uint32_t)(x) << USB_BURSTSIZE_TXPBURST_SHIFT) & USB_BURSTSIZE_TXPBURST_MASK)
#define USB_BURSTSIZE_TXPBURST_GET(x) (((uint32_t)(x) & USB_BURSTSIZE_TXPBURST_MASK) >> USB_BURSTSIZE_TXPBURST_SHIFT)

/*
 * RXPBURST (RW)
 *
 * RXPBURST
 * Programmable RX Burst Size.
 * Default value is determined by TXBURST bits in n_HWRXBUF.
 * This register represents the maximum length of a the burst in 32-bit words while moving data from the
 * USB bus to system memory.
 */
#define USB_BURSTSIZE_RXPBURST_MASK (0xFFU)
#define USB_BURSTSIZE_RXPBURST_SHIFT (0U)
#define USB_BURSTSIZE_RXPBURST_SET(x) (((uint32_t)(x) << USB_BURSTSIZE_RXPBURST_SHIFT) & USB_BURSTSIZE_RXPBURST_MASK)
#define USB_BURSTSIZE_RXPBURST_GET(x) (((uint32_t)(x) & USB_BURSTSIZE_RXPBURST_MASK) >> USB_BURSTSIZE_RXPBURST_SHIFT)

/* Bitfield definition for register: TXFILLTUNING */
/*
 * TXFIFOTHRES (RW)
 *
 * TXFIFOTHRES
 * FIFO Burst Threshold. (Read/Write)
 * This register controls the number of data bursts that are posted to the TX latency FIFO in host mode
 * before the packet begins on to the bus. The minimum value is 2 and this value should be a low as
 * possible to maximize USB performance. A higher value can be used in systems with unpredictable
 * latency and/or insufficient bandwidth where the FIFO may underrun because the data transferred from
 * the latency FIFO to USB occurs before it can be replenished from system memory. This value is ignored
 * if the Stream Disable bit in USB_n_USBMODE register is set.
 */
#define USB_TXFILLTUNING_TXFIFOTHRES_MASK (0x3F0000UL)
#define USB_TXFILLTUNING_TXFIFOTHRES_SHIFT (16U)
#define USB_TXFILLTUNING_TXFIFOTHRES_SET(x) (((uint32_t)(x) << USB_TXFILLTUNING_TXFIFOTHRES_SHIFT) & USB_TXFILLTUNING_TXFIFOTHRES_MASK)
#define USB_TXFILLTUNING_TXFIFOTHRES_GET(x) (((uint32_t)(x) & USB_TXFILLTUNING_TXFIFOTHRES_MASK) >> USB_TXFILLTUNING_TXFIFOTHRES_SHIFT)

/*
 * TXSCHHEALTH (RWC)
 *
 * TXSCHHEALTH
 * Scheduler Health Counter. (Read/Write To Clear)
 * Table continues on the next page
 * This register increments when the host controller fails to fill the TX latency FIFO to the level programmed
 * by TXFIFOTHRES before running out of time to send the packet before the next Start-Of-Frame. This
 * health counter measures the number of times this occurs to provide feedback to selecting a proper
 * TXSCHOH. Writing to this register will clear the counter and this counter will max. at 31.
 */
#define USB_TXFILLTUNING_TXSCHHEALTH_MASK (0x1F00U)
#define USB_TXFILLTUNING_TXSCHHEALTH_SHIFT (8U)
#define USB_TXFILLTUNING_TXSCHHEALTH_SET(x) (((uint32_t)(x) << USB_TXFILLTUNING_TXSCHHEALTH_SHIFT) & USB_TXFILLTUNING_TXSCHHEALTH_MASK)
#define USB_TXFILLTUNING_TXSCHHEALTH_GET(x) (((uint32_t)(x) & USB_TXFILLTUNING_TXSCHHEALTH_MASK) >> USB_TXFILLTUNING_TXSCHHEALTH_SHIFT)

/*
 * TXSCHOH (RW)
 *
 * TXSCHOH
 * Scheduler Overhead. (Read/Write) [Default = 0]
 * This register adds an additional fixed offset to the schedule time estimator described above as Tff. As an
 * approximation, the value chosen for this register should limit the number of back-off events captured in
 * the TXSCHHEALTH to less than 10 per second in a highly utilized bus. Choosing a value that is too high
 * for this register is not desired as it can needlessly reduce USB utilization. The time unit represented in
 * this register is 1.267us when a device is connected in High-Speed Mode. The time unit represented in
 * this register is 6.333us when a device is connected in Low/Full Speed Mode.
 * Default value is '08h' for OTG controller core .
 */
#define USB_TXFILLTUNING_TXSCHOH_MASK (0x7FU)
#define USB_TXFILLTUNING_TXSCHOH_SHIFT (0U)
#define USB_TXFILLTUNING_TXSCHOH_SET(x) (((uint32_t)(x) << USB_TXFILLTUNING_TXSCHOH_SHIFT) & USB_TXFILLTUNING_TXSCHOH_MASK)
#define USB_TXFILLTUNING_TXSCHOH_GET(x) (((uint32_t)(x) & USB_TXFILLTUNING_TXSCHOH_MASK) >> USB_TXFILLTUNING_TXSCHOH_SHIFT)

/* Bitfield definition for register: ENDPTNAK */
/*
 * EPTN (RWC)
 *
 * EPTN
 * TX Endpoint NAK - R/WC.
 * Each TX endpoint has 1 bit in this field. The bit is set when the
 * device sends a NAK handshake on a received IN token for the corresponding endpoint.
 * Bit [N] - Endpoint #[N], N is 0-7
 */
#define USB_ENDPTNAK_EPTN_MASK (0xFF0000UL)
#define USB_ENDPTNAK_EPTN_SHIFT (16U)
#define USB_ENDPTNAK_EPTN_SET(x) (((uint32_t)(x) << USB_ENDPTNAK_EPTN_SHIFT) & USB_ENDPTNAK_EPTN_MASK)
#define USB_ENDPTNAK_EPTN_GET(x) (((uint32_t)(x) & USB_ENDPTNAK_EPTN_MASK) >> USB_ENDPTNAK_EPTN_SHIFT)

/*
 * EPRN (RWC)
 *
 * EPRN
 * RX Endpoint NAK - R/WC.
 * Each RX endpoint has 1 bit in this field. The bit is set when the
 * device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint.
 * Bit [N] - Endpoint #[N], N is 0-7
 */
#define USB_ENDPTNAK_EPRN_MASK (0xFFU)
#define USB_ENDPTNAK_EPRN_SHIFT (0U)
#define USB_ENDPTNAK_EPRN_SET(x) (((uint32_t)(x) << USB_ENDPTNAK_EPRN_SHIFT) & USB_ENDPTNAK_EPRN_MASK)
#define USB_ENDPTNAK_EPRN_GET(x) (((uint32_t)(x) & USB_ENDPTNAK_EPRN_MASK) >> USB_ENDPTNAK_EPRN_SHIFT)

/* Bitfield definition for register: ENDPTNAKEN */
/*
 * EPTNE (RW)
 *
 * EPTNE
 * TX Endpoint NAK Enable - R/W.
 * Each bit is an enable bit for the corresponding TX Endpoint NAK bit. If this bit is set and the
 * corresponding TX Endpoint NAK bit is set, the NAK Interrupt bit is set.
 * Bit [N] - Endpoint #[N], N is 0-7
 */
#define USB_ENDPTNAKEN_EPTNE_MASK (0xFF0000UL)
#define USB_ENDPTNAKEN_EPTNE_SHIFT (16U)
#define USB_ENDPTNAKEN_EPTNE_SET(x) (((uint32_t)(x) << USB_ENDPTNAKEN_EPTNE_SHIFT) & USB_ENDPTNAKEN_EPTNE_MASK)
#define USB_ENDPTNAKEN_EPTNE_GET(x) (((uint32_t)(x) & USB_ENDPTNAKEN_EPTNE_MASK) >> USB_ENDPTNAKEN_EPTNE_SHIFT)

