hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * EPRNE (RW)
 *
 * EPRNE
 * RX Endpoint NAK Enable - R/W.
 * Each bit is an enable bit for the corresponding RX Endpoint NAK bit. If this bit is set and the
 * corresponding RX Endpoint NAK bit is set, the NAK Interrupt bit is set.
 * Bit [N] - Endpoint #[N], N is 0-7
 */
#define USB_ENDPTNAKEN_EPRNE_MASK (0xFFU)
#define USB_ENDPTNAKEN_EPRNE_SHIFT (0U)
#define USB_ENDPTNAKEN_EPRNE_SET(x) (((uint32_t)(x) << USB_ENDPTNAKEN_EPRNE_SHIFT) & USB_ENDPTNAKEN_EPRNE_MASK)
#define USB_ENDPTNAKEN_EPRNE_GET(x) (((uint32_t)(x) & USB_ENDPTNAKEN_EPRNE_MASK) >> USB_ENDPTNAKEN_EPRNE_SHIFT)

/* Bitfield definition for register: CONFIGFLAG */
/*
 * CF (RO)
 *
 * CCF
 * Configure Flag
 * Host software sets this bit as the last action in its process of configuring the Host Controller. This bit
 * controls the default port-routing control logic.
 * 0 - Port routing control logic default-routes each port to an implementation dependent classic host
 * controller.
 * 1 - Port routing control logic default-routes all ports to this host controller.
 */
#define USB_CONFIGFLAG_CF_MASK (0x1U)
#define USB_CONFIGFLAG_CF_SHIFT (0U)
#define USB_CONFIGFLAG_CF_GET(x) (((uint32_t)(x) & USB_CONFIGFLAG_CF_MASK) >> USB_CONFIGFLAG_CF_SHIFT)

/* Bitfield definition for register: PORTSC1 */
/*
 * PTS_1 (RW)
 *
 * PTS_1
 * Bit field {bit25, bit31, bit30}:
 * "000b" UTMI/UTMI+
 * "001b" Reserved
 * "010b" ULPI
 * "011b" Serial/USB 1.1 PHY/IC-USB (FS Only)
 * "100b" HSIC
 * Parallel Transceiver Select (bit25, bit31, bit30).
 * For OTG core, it's Read-Only.
 * For Host1/Host2/Host3 core, it's Read/Write.
 * NOTE: All USB port interface modes are listed in this field description, but not all are supported. For
 * detail feature of each controller core, please see Features . The behaviour is unknown when
 * unsupported interface mode is selected.
 */
#define USB_PORTSC1_PTS_1_MASK (0xC0000000UL)
#define USB_PORTSC1_PTS_1_SHIFT (30U)
#define USB_PORTSC1_PTS_1_SET(x) (((uint32_t)(x) << USB_PORTSC1_PTS_1_SHIFT) & USB_PORTSC1_PTS_1_MASK)
#define USB_PORTSC1_PTS_1_GET(x) (((uint32_t)(x) & USB_PORTSC1_PTS_1_MASK) >> USB_PORTSC1_PTS_1_SHIFT)

/*
 * STS (RW)
 *
 * STS
 * Serial Transceiver Select
 * 1 Serial Interface Engine is selected
 * 0 Parallel Interface signals is selected
 * Serial Interface Engine can be used in combination with UTMI+/ULPI physical interface to provide FS/LS
 * signaling instead of the parallel interface signals.
 * When this bit is set '1b', serial interface engine will be used instead of parallel interface signals.
 * This bit has no effect unless PTS bits is set to select UTMI+/ULPI interface.
 * The Serial/USB1.1 PHY/IC-USB will use the serial interface engine for FS/LS signaling regardless of this
 * bit value.
 */
#define USB_PORTSC1_STS_MASK (0x20000000UL)
#define USB_PORTSC1_STS_SHIFT (29U)
#define USB_PORTSC1_STS_SET(x) (((uint32_t)(x) << USB_PORTSC1_STS_SHIFT) & USB_PORTSC1_STS_MASK)
#define USB_PORTSC1_STS_GET(x) (((uint32_t)(x) & USB_PORTSC1_STS_MASK) >> USB_PORTSC1_STS_SHIFT)

/*
 * PTW (RW)
 *
 * PTW
 * Parallel Transceiver Width
 * This bit has no effect if serial interface engine is used.
 * 0 - Select the 8-bit UTMI interface [60MHz]
 * 1 - Select the 16-bit UTMI interface [30MHz]
 */
#define USB_PORTSC1_PTW_MASK (0x10000000UL)
#define USB_PORTSC1_PTW_SHIFT (28U)
#define USB_PORTSC1_PTW_SET(x) (((uint32_t)(x) << USB_PORTSC1_PTW_SHIFT) & USB_PORTSC1_PTW_MASK)
#define USB_PORTSC1_PTW_GET(x) (((uint32_t)(x) & USB_PORTSC1_PTW_MASK) >> USB_PORTSC1_PTW_SHIFT)

/*
 * PSPD (RO)
 *
 * PSPD
 * Port Speed - Read Only.
 * This register field indicates the speed at which the port is operating.
 * 00 - Full Speed
 * 01 - Low Speed
 * 10 - High Speed
 * 11 - Undefined
 */
#define USB_PORTSC1_PSPD_MASK (0xC000000UL)
#define USB_PORTSC1_PSPD_SHIFT (26U)
#define USB_PORTSC1_PSPD_GET(x) (((uint32_t)(x) & USB_PORTSC1_PSPD_MASK) >> USB_PORTSC1_PSPD_SHIFT)

/*
 * PTS_2 (RW)
 *
 * PTS_2
 * See description at bits 31-30
 */
#define USB_PORTSC1_PTS_2_MASK (0x2000000UL)
#define USB_PORTSC1_PTS_2_SHIFT (25U)
#define USB_PORTSC1_PTS_2_SET(x) (((uint32_t)(x) << USB_PORTSC1_PTS_2_SHIFT) & USB_PORTSC1_PTS_2_MASK)
#define USB_PORTSC1_PTS_2_GET(x) (((uint32_t)(x) & USB_PORTSC1_PTS_2_MASK) >> USB_PORTSC1_PTS_2_SHIFT)

/*
 * PFSC (RW)
 *
 * PFSC
 * Port Force Full Speed Connect - Read/Write. Default = 0b.
 * When this bit is set to '1b', the port will be forced to only connect at Full Speed, It disables the chirp
 * sequence that allows the port to identify itself as High Speed.
 * 0 - Normal operation
 * 1 - Forced to full speed
 */
#define USB_PORTSC1_PFSC_MASK (0x1000000UL)
#define USB_PORTSC1_PFSC_SHIFT (24U)
#define USB_PORTSC1_PFSC_SET(x) (((uint32_t)(x) << USB_PORTSC1_PFSC_SHIFT) & USB_PORTSC1_PFSC_MASK)
#define USB_PORTSC1_PFSC_GET(x) (((uint32_t)(x) & USB_PORTSC1_PFSC_MASK) >> USB_PORTSC1_PFSC_SHIFT)

/*
 * PHCD (RW)
 *
 * PHCD
 * PHY Low Power Suspend - Clock Disable (PLPSCD) - Read/Write. Default = 0b.
 * When this bit is set to '1b', the PHY clock is disabled. Reading this bit will indicate the status of the PHY
 * clock.
 * NOTE: The PHY clock cannot be disabled if it is being used as the system clock.
 * In device mode, The PHY can be put into Low Power Suspend when the device is not running (USBCMD
 * Run/Stop=0b) or the host has signalled suspend (PORTSC1 SUSPEND=1b). PHY Low power suspend
 * will be cleared automatically when the host initials resume. Before forcing a resume from the device, the
 * device controller driver must clear this bit.
 * In host mode, the PHY can be put into Low Power Suspend when the downstream device has been put
 * into suspend mode or when no downstream device is connected. Low power suspend is completely
 * under the control of software.
 * 0 - Enable PHY clock
 * 1 - Disable PHY clock
 */
#define USB_PORTSC1_PHCD_MASK (0x800000UL)
#define USB_PORTSC1_PHCD_SHIFT (23U)
#define USB_PORTSC1_PHCD_SET(x) (((uint32_t)(x) << USB_PORTSC1_PHCD_SHIFT) & USB_PORTSC1_PHCD_MASK)
#define USB_PORTSC1_PHCD_GET(x) (((uint32_t)(x) & USB_PORTSC1_PHCD_MASK) >> USB_PORTSC1_PHCD_SHIFT)

