hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * WKOC (RW)
 *
 * WKOC
 * Wake on Over-current Enable (WKOC_E) - Read/Write. Default = 0b.
 * Writing this bit to a one enables the port to be sensitive to over-current conditions as wake-up events.
 * This field is zero if Port Power(PORTSC1) is zero.
 */
#define USB_PORTSC1_WKOC_MASK (0x400000UL)
#define USB_PORTSC1_WKOC_SHIFT (22U)
#define USB_PORTSC1_WKOC_SET(x) (((uint32_t)(x) << USB_PORTSC1_WKOC_SHIFT) & USB_PORTSC1_WKOC_MASK)
#define USB_PORTSC1_WKOC_GET(x) (((uint32_t)(x) & USB_PORTSC1_WKOC_MASK) >> USB_PORTSC1_WKOC_SHIFT)

/*
 * WKDC (RW)
 *
 * WKDC
 * Wake on Disconnect Enable (WKDSCNNT_E) - Read/Write. Default=0b. Writing this bit to a one enables
 * the port to be sensitive to device disconnects as wake-up events.
 * This field is zero if Port Power(PORTSC1) is zero or in device mode.
 */
#define USB_PORTSC1_WKDC_MASK (0x200000UL)
#define USB_PORTSC1_WKDC_SHIFT (21U)
#define USB_PORTSC1_WKDC_SET(x) (((uint32_t)(x) << USB_PORTSC1_WKDC_SHIFT) & USB_PORTSC1_WKDC_MASK)
#define USB_PORTSC1_WKDC_GET(x) (((uint32_t)(x) & USB_PORTSC1_WKDC_MASK) >> USB_PORTSC1_WKDC_SHIFT)

/*
 * WKCN (RW)
 *
 * WKCN
 * Wake on Connect Enable (WKCNNT_E) - Read/Write. Default=0b.
 * Writing this bit to a one enables the port to be sensitive to device connects as wake-up events.
 * This field is zero if Port Power(PORTSC1) is zero or in device mode.
 */
#define USB_PORTSC1_WKCN_MASK (0x100000UL)
#define USB_PORTSC1_WKCN_SHIFT (20U)
#define USB_PORTSC1_WKCN_SET(x) (((uint32_t)(x) << USB_PORTSC1_WKCN_SHIFT) & USB_PORTSC1_WKCN_MASK)
#define USB_PORTSC1_WKCN_GET(x) (((uint32_t)(x) & USB_PORTSC1_WKCN_MASK) >> USB_PORTSC1_WKCN_SHIFT)

/*
 * PTC (RW)
 *
 * PTC
 * Port Test Control - Read/Write. Default = 0000b.
 * Refer to Port Test Mode for the operational model for using these test modes and the USB Specification
 * Revision 2.0, Chapter 7 for details on each test mode.
 * The FORCE_ENABLE_FS and FORCE ENABLE_LS are extensions to the test mode support specified in
 * the EHCI specification. Writing the PTC field to any of the FORCE_ENABLE_{HS/FS/LS} values will force
 * the port into the connected and enabled state at the selected speed. Writing the PTC field back to
 * TEST_MODE_DISABLE will allow the port state machines to progress normally from that point.
 * NOTE: Low speed operations are not supported as a peripheral device.
 * Any other value than zero indicates that the port is operating in test mode.
 * Value Specific Test
 * 0000 - TEST_MODE_DISABLE
 * 0001 - J_STATE
 * 0010 - K_STATE
 * 0011 - SE0 (host) / NAK (device)
 * 0100 - Packet
 * 0101 - FORCE_ENABLE_HS
 * 0110 - FORCE_ENABLE_FS
 * 0111 - FORCE_ENABLE_LS
 * 1000-1111 - Reserved
 */
#define USB_PORTSC1_PTC_MASK (0xF0000UL)
#define USB_PORTSC1_PTC_SHIFT (16U)
#define USB_PORTSC1_PTC_SET(x) (((uint32_t)(x) << USB_PORTSC1_PTC_SHIFT) & USB_PORTSC1_PTC_MASK)
#define USB_PORTSC1_PTC_GET(x) (((uint32_t)(x) & USB_PORTSC1_PTC_MASK) >> USB_PORTSC1_PTC_SHIFT)

/*
 * PIC (RW)
 *
 * PIC
 * Port Indicator Control - Read/Write. Default = Ob.
 * Writing to this field has no effect if the P_INDICATOR bit in the HCSPARAMS register is a zero.
 * Refer to the USB Specification Revision 2.0 for a description on how these bits are to be used.
 * This field is zero if Port Power is zero.
 * Bit Value Meaning
 * 00 - Port indicators are off
 * 01 - Amber
 * 10 - Green
 * 11 - Undefined
 */
#define USB_PORTSC1_PIC_MASK (0xC000U)
#define USB_PORTSC1_PIC_SHIFT (14U)
#define USB_PORTSC1_PIC_SET(x) (((uint32_t)(x) << USB_PORTSC1_PIC_SHIFT) & USB_PORTSC1_PIC_MASK)
#define USB_PORTSC1_PIC_GET(x) (((uint32_t)(x) & USB_PORTSC1_PIC_MASK) >> USB_PORTSC1_PIC_SHIFT)

/*
 * PO (RO)
 *
 * PO
 * Port Owner-Read/Write. Default = 0.
 * This bit unconditionally goes to a 0 when the configured bit in the CONFIGFLAG register makes a 0 to 1
 * transition. This bit unconditionally goes to 1 whenever the Configured bit is zero System software uses
 * this field to release ownership of the port to a selected host controller (in the event that the attached
 * device is not a high-speed device). Software writes a one to this bit when the attached device is not a
 * high-speed device. A one in this bit means that an internal companion controller owns and controls the
 * port.
 * Port owner handoff is not supported in all controller cores, therefore this bit will always be 0.
 */
#define USB_PORTSC1_PO_MASK (0x2000U)
#define USB_PORTSC1_PO_SHIFT (13U)
#define USB_PORTSC1_PO_GET(x) (((uint32_t)(x) & USB_PORTSC1_PO_MASK) >> USB_PORTSC1_PO_SHIFT)

/*
 * PP (RW)
 *
 * PP
 * Port Power (PP)-Read/Write or Read Only.
 * The function of this bit depends on the value of the Port Power Switching (PPC) field in the HCSPARAMS
 * register. The behavior is as follows:
 * PPC
 * PP Operation
 * 0
 * 1b Read Only - Host controller does not have port power control switches. Each port is hard-wired to
 * power.
 * 1
 * 1b/0b - Read/Write. OTG controller requires port power control switches. This bit represents the current
 * setting of the switch (0=off, 1=on). When power is not available on a port (that is, PP equals a 0), the
 * port is non-functional and will not report attaches, detaches, etc.
 * When an over-current condition is detected on a powered port and PPC is a one, the PP bit in each
 * affected port may be transitional by the host controller driver from a one to a zero (removing power from
 * the port).
 * This feature is implemented in all controller cores (PPC = 1).
 */
#define USB_PORTSC1_PP_MASK (0x1000U)
#define USB_PORTSC1_PP_SHIFT (12U)
#define USB_PORTSC1_PP_SET(x) (((uint32_t)(x) << USB_PORTSC1_PP_SHIFT) & USB_PORTSC1_PP_MASK)
#define USB_PORTSC1_PP_GET(x) (((uint32_t)(x) & USB_PORTSC1_PP_MASK) >> USB_PORTSC1_PP_SHIFT)

/*
 * LS (RO)
 *
 * LS
 * Line Status-Read Only. These bits reflect the current logical levels of the D+ (bit 11) and D- (bit 10) signal
 * lines.
 * In host mode, the use of linestate by the host controller driver is not necessary (unlike EHCI), because
 * the port controller state machine and the port routing manage the connection of LS and FS.
 * In device mode, the use of linestate by the device controller driver is not necessary.
 * The encoding of the bits are:
 * Bits [11:10] Meaning
 * 00 - SE0
 * 01 - K-state
 * 10 - J-state
 * 11 - Undefined
 */
#define USB_PORTSC1_LS_MASK (0xC00U)
#define USB_PORTSC1_LS_SHIFT (10U)
#define USB_PORTSC1_LS_GET(x) (((uint32_t)(x) & USB_PORTSC1_LS_MASK) >> USB_PORTSC1_LS_SHIFT)

