hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * HSP (RO)
 *
 * HSP
 * High-Speed Port - Read Only. Default = 0b.
 * When the bit is one, the host/device connected to the port is in high-speed mode and if set to zero, the
 * host/device connected to the port is not in a high-speed mode.
 * NOTE: HSP is redundant with PSPD(bit 27, 26) but remained for compatibility.
 */
#define USB_PORTSC1_HSP_MASK (0x200U)
#define USB_PORTSC1_HSP_SHIFT (9U)
#define USB_PORTSC1_HSP_GET(x) (((uint32_t)(x) & USB_PORTSC1_HSP_MASK) >> USB_PORTSC1_HSP_SHIFT)

/*
 * PR (RW)
 *
 * PR
 * Port Reset - Read/Write or Read Only. Default = 0b.
 * In Host Mode: Read/Write. 1=Port is in Reset. 0=Port is not in Reset. Default 0.
 * When software writes a one to this bit the bus-reset sequence as defined in the USB Specification
 * Revision 2.0 is started. This bit will automatically change to zero after the reset sequence is complete.
 * This behavior is different from EHCI where the host controller driver is required to set this bit to a zero
 * after the reset duration is timed in the driver.
 * In Device Mode: This bit is a read only status bit. Device reset from the USB bus is also indicated in the
 * USBSTS register.
 * This field is zero if Port Power(PORTSC1) is zero.
 */
#define USB_PORTSC1_PR_MASK (0x100U)
#define USB_PORTSC1_PR_SHIFT (8U)
#define USB_PORTSC1_PR_SET(x) (((uint32_t)(x) << USB_PORTSC1_PR_SHIFT) & USB_PORTSC1_PR_MASK)
#define USB_PORTSC1_PR_GET(x) (((uint32_t)(x) & USB_PORTSC1_PR_MASK) >> USB_PORTSC1_PR_SHIFT)

/*
 * SUSP (RW)
 *
 * SUSP
 * Suspend - Read/Write or Read Only. Default = 0b.
 * 1=Port in suspend state. 0=Port not in suspend state.
 * In Host Mode: Read/Write.
 * Port Enabled Bit and Suspend bit of this register define the port states as follows:
 * Bits [Port Enabled, Suspend] Port State
 * 0x Disable
 * 10 Enable
 * 11 Suspend
 * When in suspend state, downstream propagation of data is blocked on this port, except for port reset.
 * The blocking occurs at the end of the current transaction if a transaction was in progress when this bit
 * was written to 1. In the suspend state, the port is sensitive to resume detection. Note that the bit status
 * does not change until the port is suspended and that there may be a delay in suspending a port if there is
 * a transaction currently in progress on the USB.
 * The host controller will unconditionally set this bit to zero when software sets the Force Port Resume bit
 * to zero. The host controller ignores a write of zero to this bit.
 * If host software sets this bit to a one when the port is not enabled (that is, Port enabled bit is a zero) the
 * results are undefined.
 * This field is zero if Port Power(PORTSC1) is zero in host mode.
 * In Device Mode: Read Only.
 * In device mode this bit is a read only status bit.
 */
#define USB_PORTSC1_SUSP_MASK (0x80U)
#define USB_PORTSC1_SUSP_SHIFT (7U)
#define USB_PORTSC1_SUSP_SET(x) (((uint32_t)(x) << USB_PORTSC1_SUSP_SHIFT) & USB_PORTSC1_SUSP_MASK)
#define USB_PORTSC1_SUSP_GET(x) (((uint32_t)(x) & USB_PORTSC1_SUSP_MASK) >> USB_PORTSC1_SUSP_SHIFT)

/*
 * FPR (RW)
 *
 * FPR
 * Force Port Resume -Read/Write. 1= Resume detected/driven on port. 0=No resume (K-state) detected/
 * driven on port. Default = 0.
 * In Host Mode:
 * Software sets this bit to one to drive resume signaling. The Host Controller sets this bit to one if a J-to-K
 * transition is detected while the port is in the Suspend state. When this bit transitions to a one because a
 * J-to-K transition is detected, the Port Change Detect bit in the USBSTS register is also set to one. This
 * bit will automatically change to zero after the resume sequence is complete. This behavior is different
 * from EHCI where the host controller driver is required to set this bit to a zero after the resume duration is
 * timed in the driver.
 * Note that when the Host controller owns the port, the resume sequence follows the defined sequence
 * documented in the USB Specification Revision 2.0. The resume signaling (Full-speed 'K') is driven on the
 * port as long as this bit remains a one. This bit will remain a one until the port has switched to the high-
 * speed idle. Writing a zero has no effect because the port controller will time the resume operation, clear
 * the bit the port control state switches to HS or FS idle.
 * This field is zero if Port Power(PORTSC1) is zero in host mode.
 * This bit is not-EHCI compatible.
 * In Device mode:
 * After the device has been in Suspend State for 5ms or more, software must set this bit to one to drive
 * resume signaling before clearing. The Device Controller will set this bit to one if a J-to-K transition is
 * detected while the port is in the Suspend state. The bit will be cleared when the device returns to normal
 * operation. Also, when this bit wil be cleared because a K-to-J transition detected, the Port Change Detect
 * bit in the USBSTS register is also set to one.
 */
#define USB_PORTSC1_FPR_MASK (0x40U)
#define USB_PORTSC1_FPR_SHIFT (6U)
#define USB_PORTSC1_FPR_SET(x) (((uint32_t)(x) << USB_PORTSC1_FPR_SHIFT) & USB_PORTSC1_FPR_MASK)
#define USB_PORTSC1_FPR_GET(x) (((uint32_t)(x) & USB_PORTSC1_FPR_MASK) >> USB_PORTSC1_FPR_SHIFT)

/*
 * OCC (RW)
 *
 * OCC
 * Over-current Change-R/WC. Default=0.
 * This bit is set '1b' by hardware when there is a change to Over-current Active. Software can clear this bit
 * by writing a one to this bit position.
 */
#define USB_PORTSC1_OCC_MASK (0x20U)
#define USB_PORTSC1_OCC_SHIFT (5U)
#define USB_PORTSC1_OCC_SET(x) (((uint32_t)(x) << USB_PORTSC1_OCC_SHIFT) & USB_PORTSC1_OCC_MASK)
#define USB_PORTSC1_OCC_GET(x) (((uint32_t)(x) & USB_PORTSC1_OCC_MASK) >> USB_PORTSC1_OCC_SHIFT)

/*
 * OCA (RO)
 *
 * OCA
 * Over-current Active-Read Only. Default 0.
 * This bit will automatically transition from one to zero when the over current condition is removed.
 * 0 - This port does not have an over-current condition.
 * 1 - This port currently has an over-current condition
 */
#define USB_PORTSC1_OCA_MASK (0x10U)
#define USB_PORTSC1_OCA_SHIFT (4U)
#define USB_PORTSC1_OCA_GET(x) (((uint32_t)(x) & USB_PORTSC1_OCA_MASK) >> USB_PORTSC1_OCA_SHIFT)

