hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * PEC (RWC)
 *
 * PEC
 * Port Enable/Disable Change-R/WC. 1=Port enabled/disabled status has changed. 0=No change. Default
 * = 0.
 * In Host Mode:
 * For the root hub, this bit is set to a one only when a port is disabled due to disconnect on the port or due
 * to the appropriate conditions existing at the EOF2 point (See Chapter 11 of the USB Specification).
 * Software clears this by writing a one to it.
 * This field is zero if Port Power(PORTSC1) is zero.
 * In Device mode:
 * The device port is always enabled, so this bit is always '0b'.
 */
#define USB_PORTSC1_PEC_MASK (0x8U)
#define USB_PORTSC1_PEC_SHIFT (3U)
#define USB_PORTSC1_PEC_SET(x) (((uint32_t)(x) << USB_PORTSC1_PEC_SHIFT) & USB_PORTSC1_PEC_MASK)
#define USB_PORTSC1_PEC_GET(x) (((uint32_t)(x) & USB_PORTSC1_PEC_MASK) >> USB_PORTSC1_PEC_SHIFT)

/*
 * PE (RWC)
 *
 * PE
 * Port Enabled/Disabled-Read/Write. 1=Enable. 0=Disable. Default 0.
 * In Host Mode:
 * Ports can only be enabled by the host controller as a part of the reset and enable. Software cannot
 * enable a port by writing a one to this field. Ports can be disabled by either a fault condition (disconnect
 * event or other fault condition) or by the host software. Note that the bit status does not change until the
 * port state actually changes. There may be a delay in disabling or enabling a port due to other host
 * controller and bus events.
 * When the port is disabled, (0b) downstream propagation of data is blocked except for reset.
 * This field is zero if Port Power(PORTSC1) is zero in host mode.
 * In Device Mode:
 * The device port is always enabled, so this bit is always '1b'.
 */
#define USB_PORTSC1_PE_MASK (0x4U)
#define USB_PORTSC1_PE_SHIFT (2U)
#define USB_PORTSC1_PE_SET(x) (((uint32_t)(x) << USB_PORTSC1_PE_SHIFT) & USB_PORTSC1_PE_MASK)
#define USB_PORTSC1_PE_GET(x) (((uint32_t)(x) & USB_PORTSC1_PE_MASK) >> USB_PORTSC1_PE_SHIFT)

/*
 * CSC (RWC)
 *
 * CSC
 * Connect Status Change-R/WC. 1 =Change in Current Connect Status. 0=No change. Default 0.
 * In Host Mode:
 * Indicates a change has occurred in the port's Current Connect Status. The host/device controller sets this
 * bit for all changes to the port device connect status, even if system software has not cleared an existing
 * connect status change. For example, the insertion status changes twice before system software has
 * cleared the changed condition, hub hardware will be 'setting' an already-set bit (that is, the bit will remain
 * set). Software clears this bit by writing a one to it.
 * This field is zero if Port Power(PORTSC1) is zero in host mode.
 * In Device Mode:
 * This bit is undefined in device controller mode.
 */
#define USB_PORTSC1_CSC_MASK (0x2U)
#define USB_PORTSC1_CSC_SHIFT (1U)
#define USB_PORTSC1_CSC_SET(x) (((uint32_t)(x) << USB_PORTSC1_CSC_SHIFT) & USB_PORTSC1_CSC_MASK)
#define USB_PORTSC1_CSC_GET(x) (((uint32_t)(x) & USB_PORTSC1_CSC_MASK) >> USB_PORTSC1_CSC_SHIFT)

/*
 * CCS (RWC)
 *
 * CCS
 * Current Connect Status-Read Only.
 * In Host Mode:
 * 1=Device is present on port. 0=No device is present. Default = 0. This value reflects the current state of
 * the port, and may not correspond directly to the event that caused the Connect Status Change bit (Bit 1)
 * to be set.
 * This field is zero if Port Power(PORTSC1) is zero in host mode.
 * In Device Mode:
 * 1=Attached. 0=Not Attached. Default=0. A one indicates that the device successfully attached and is
 * operating in either high speed or full speed as indicated by the High Speed Port bit in this register. A zero
 * indicates that the device did not attach successfully or was forcibly disconnected by the software writing a
 * zero to the Run bit in the USBCMD register. It does not state the device being disconnected or
 * Suspended.
 */
#define USB_PORTSC1_CCS_MASK (0x1U)
#define USB_PORTSC1_CCS_SHIFT (0U)
#define USB_PORTSC1_CCS_SET(x) (((uint32_t)(x) << USB_PORTSC1_CCS_SHIFT) & USB_PORTSC1_CCS_MASK)
#define USB_PORTSC1_CCS_GET(x) (((uint32_t)(x) & USB_PORTSC1_CCS_MASK) >> USB_PORTSC1_CCS_SHIFT)

/* Bitfield definition for register: OTGSC */
/*
 * DPIE (RW)
 *
 * DPIE
 * Data Pulse Interrupt Enable
 */
#define USB_OTGSC_DPIE_MASK (0x40000000UL)
#define USB_OTGSC_DPIE_SHIFT (30U)
#define USB_OTGSC_DPIE_SET(x) (((uint32_t)(x) << USB_OTGSC_DPIE_SHIFT) & USB_OTGSC_DPIE_MASK)
#define USB_OTGSC_DPIE_GET(x) (((uint32_t)(x) & USB_OTGSC_DPIE_MASK) >> USB_OTGSC_DPIE_SHIFT)

/*
 * EN_1MS (RW)
 *
 * EN_1MS
 * 1 millisecond timer Interrupt Enable - Read/Write
 */
#define USB_OTGSC_EN_1MS_MASK (0x20000000UL)
#define USB_OTGSC_EN_1MS_SHIFT (29U)
#define USB_OTGSC_EN_1MS_SET(x) (((uint32_t)(x) << USB_OTGSC_EN_1MS_SHIFT) & USB_OTGSC_EN_1MS_MASK)
#define USB_OTGSC_EN_1MS_GET(x) (((uint32_t)(x) & USB_OTGSC_EN_1MS_MASK) >> USB_OTGSC_EN_1MS_SHIFT)

/*
 * BSEIE (RW)
 *
 * BSEIE
 * B Session End Interrupt Enable - Read/Write.
 * Setting this bit enables the B session end interrupt.
 */
#define USB_OTGSC_BSEIE_MASK (0x10000000UL)
#define USB_OTGSC_BSEIE_SHIFT (28U)
#define USB_OTGSC_BSEIE_SET(x) (((uint32_t)(x) << USB_OTGSC_BSEIE_SHIFT) & USB_OTGSC_BSEIE_MASK)
#define USB_OTGSC_BSEIE_GET(x) (((uint32_t)(x) & USB_OTGSC_BSEIE_MASK) >> USB_OTGSC_BSEIE_SHIFT)

/*
 * BSVIE (RW)
 *
 * BSVIE
 * B Session Valid Interrupt Enable - Read/Write.
 * Setting this bit enables the B session valid interrupt.
 */
#define USB_OTGSC_BSVIE_MASK (0x8000000UL)
#define USB_OTGSC_BSVIE_SHIFT (27U)
#define USB_OTGSC_BSVIE_SET(x) (((uint32_t)(x) << USB_OTGSC_BSVIE_SHIFT) & USB_OTGSC_BSVIE_MASK)
#define USB_OTGSC_BSVIE_GET(x) (((uint32_t)(x) & USB_OTGSC_BSVIE_MASK) >> USB_OTGSC_BSVIE_SHIFT)

/*
 * ASVIE (RW)
 *
 * ASVIE
 * A Session Valid Interrupt Enable - Read/Write.
 */
#define USB_OTGSC_ASVIE_MASK (0x4000000UL)
#define USB_OTGSC_ASVIE_SHIFT (26U)
#define USB_OTGSC_ASVIE_SET(x) (((uint32_t)(x) << USB_OTGSC_ASVIE_SHIFT) & USB_OTGSC_ASVIE_MASK)
#define USB_OTGSC_ASVIE_GET(x) (((uint32_t)(x) & USB_OTGSC_ASVIE_MASK) >> USB_OTGSC_ASVIE_SHIFT)

/*
 * AVVIE (RW)
 *
 * AVVIE
 * A VBus Valid Interrupt Enable - Read/Write.
 * Setting this bit enables the A VBus valid interrupt.
 */
#define USB_OTGSC_AVVIE_MASK (0x2000000UL)
#define USB_OTGSC_AVVIE_SHIFT (25U)
#define USB_OTGSC_AVVIE_SET(x) (((uint32_t)(x) << USB_OTGSC_AVVIE_SHIFT) & USB_OTGSC_AVVIE_MASK)
#define USB_OTGSC_AVVIE_GET(x) (((uint32_t)(x) & USB_OTGSC_AVVIE_MASK) >> USB_OTGSC_AVVIE_SHIFT)

