hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * IDIE (RW)
 *
 * IDIE
 * USB ID Interrupt Enable - Read/Write.
 * Setting this bit enables the USB ID interrupt.
 */
#define USB_OTGSC_IDIE_MASK (0x1000000UL)
#define USB_OTGSC_IDIE_SHIFT (24U)
#define USB_OTGSC_IDIE_SET(x) (((uint32_t)(x) << USB_OTGSC_IDIE_SHIFT) & USB_OTGSC_IDIE_MASK)
#define USB_OTGSC_IDIE_GET(x) (((uint32_t)(x) & USB_OTGSC_IDIE_MASK) >> USB_OTGSC_IDIE_SHIFT)

/*
 * DPIS (RWC)
 *
 * DPIS
 * Data Pulse Interrupt Status - Read/Write to Clear.
 * This bit is set when data bus pulsing occurs on DP or DM. Data bus pulsing is only detected when
 * USBMODE.CM = Host (11) and PORTSC1(0)[PP] = 0.
 * Software must write a one to clear this bit.
 */
#define USB_OTGSC_DPIS_MASK (0x400000UL)
#define USB_OTGSC_DPIS_SHIFT (22U)
#define USB_OTGSC_DPIS_SET(x) (((uint32_t)(x) << USB_OTGSC_DPIS_SHIFT) & USB_OTGSC_DPIS_MASK)
#define USB_OTGSC_DPIS_GET(x) (((uint32_t)(x) & USB_OTGSC_DPIS_MASK) >> USB_OTGSC_DPIS_SHIFT)

/*
 * STATUS_1MS (RWC)
 *
 * STATUS_1MS
 * 1 millisecond timer Interrupt Status - Read/Write to Clear.
 * This bit is set once every millisecond.
 * Software must write a one to clear this bit.
 */
#define USB_OTGSC_STATUS_1MS_MASK (0x200000UL)
#define USB_OTGSC_STATUS_1MS_SHIFT (21U)
#define USB_OTGSC_STATUS_1MS_SET(x) (((uint32_t)(x) << USB_OTGSC_STATUS_1MS_SHIFT) & USB_OTGSC_STATUS_1MS_MASK)
#define USB_OTGSC_STATUS_1MS_GET(x) (((uint32_t)(x) & USB_OTGSC_STATUS_1MS_MASK) >> USB_OTGSC_STATUS_1MS_SHIFT)

/*
 * BSEIS (RWC)
 *
 * BSEIS
 * B Session End Interrupt Status - Read/Write to Clear.
 * This bit is set when VBus has fallen below the B session end threshold. Software must write a one to
 * clear this bit.
 */
#define USB_OTGSC_BSEIS_MASK (0x100000UL)
#define USB_OTGSC_BSEIS_SHIFT (20U)
#define USB_OTGSC_BSEIS_SET(x) (((uint32_t)(x) << USB_OTGSC_BSEIS_SHIFT) & USB_OTGSC_BSEIS_MASK)
#define USB_OTGSC_BSEIS_GET(x) (((uint32_t)(x) & USB_OTGSC_BSEIS_MASK) >> USB_OTGSC_BSEIS_SHIFT)

/*
 * BSVIS (RWC)
 *
 * BSVIS
 * B Session Valid Interrupt Status - Read/Write to Clear.
 * This bit is set when VBus has either risen above or fallen below the B session valid threshold.
 * Software must write a one to clear this bit.
 */
#define USB_OTGSC_BSVIS_MASK (0x80000UL)
#define USB_OTGSC_BSVIS_SHIFT (19U)
#define USB_OTGSC_BSVIS_SET(x) (((uint32_t)(x) << USB_OTGSC_BSVIS_SHIFT) & USB_OTGSC_BSVIS_MASK)
#define USB_OTGSC_BSVIS_GET(x) (((uint32_t)(x) & USB_OTGSC_BSVIS_MASK) >> USB_OTGSC_BSVIS_SHIFT)

/*
 * ASVIS (RWC)
 *
 * ASVIS
 * A Session Valid Interrupt Status - Read/Write to Clear.
 * This bit is set when VBus has either risen above or fallen below the A session valid threshold.
 * Software must write a one to clear this bit.
 */
#define USB_OTGSC_ASVIS_MASK (0x40000UL)
#define USB_OTGSC_ASVIS_SHIFT (18U)
#define USB_OTGSC_ASVIS_SET(x) (((uint32_t)(x) << USB_OTGSC_ASVIS_SHIFT) & USB_OTGSC_ASVIS_MASK)
#define USB_OTGSC_ASVIS_GET(x) (((uint32_t)(x) & USB_OTGSC_ASVIS_MASK) >> USB_OTGSC_ASVIS_SHIFT)

/*
 * AVVIS (RWC)
 *
 * AVVIS
 * A VBus Valid Interrupt Status - Read/Write to Clear.
 * This bit is set when VBus has either risen above or fallen below the VBus valid threshold on an A device.
 * Software must write a one to clear this bit.
 */
#define USB_OTGSC_AVVIS_MASK (0x20000UL)
#define USB_OTGSC_AVVIS_SHIFT (17U)
#define USB_OTGSC_AVVIS_SET(x) (((uint32_t)(x) << USB_OTGSC_AVVIS_SHIFT) & USB_OTGSC_AVVIS_MASK)
#define USB_OTGSC_AVVIS_GET(x) (((uint32_t)(x) & USB_OTGSC_AVVIS_MASK) >> USB_OTGSC_AVVIS_SHIFT)

/*
 * IDIS (RWC)
 *
 * IDIS
 * USB ID Interrupt Status - Read/Write.
 * This bit is set when a change on the ID input has been detected.
 * Software must write a one to clear this bit.
 */
#define USB_OTGSC_IDIS_MASK (0x10000UL)
#define USB_OTGSC_IDIS_SHIFT (16U)
#define USB_OTGSC_IDIS_SET(x) (((uint32_t)(x) << USB_OTGSC_IDIS_SHIFT) & USB_OTGSC_IDIS_MASK)
#define USB_OTGSC_IDIS_GET(x) (((uint32_t)(x) & USB_OTGSC_IDIS_MASK) >> USB_OTGSC_IDIS_SHIFT)

/*
 * DPS (RO)
 *
 * DPS
 * Data Bus Pulsing Status - Read Only.
 * A '1' indicates data bus pulsing is being detected on the port.
 */
#define USB_OTGSC_DPS_MASK (0x4000U)
#define USB_OTGSC_DPS_SHIFT (14U)
#define USB_OTGSC_DPS_GET(x) (((uint32_t)(x) & USB_OTGSC_DPS_MASK) >> USB_OTGSC_DPS_SHIFT)

/*
 * TOG_1MS (RO)
 *
 * TOG_1MS
 * 1 millisecond timer toggle - Read Only.
 * This bit toggles once per millisecond.
 */
#define USB_OTGSC_TOG_1MS_MASK (0x2000U)
#define USB_OTGSC_TOG_1MS_SHIFT (13U)
#define USB_OTGSC_TOG_1MS_GET(x) (((uint32_t)(x) & USB_OTGSC_TOG_1MS_MASK) >> USB_OTGSC_TOG_1MS_SHIFT)

/*
 * BSE (RO)
 *
 * BSE
 * B Session End - Read Only.
 * Indicates VBus is below the B session end threshold.
 */
#define USB_OTGSC_BSE_MASK (0x1000U)
#define USB_OTGSC_BSE_SHIFT (12U)
#define USB_OTGSC_BSE_GET(x) (((uint32_t)(x) & USB_OTGSC_BSE_MASK) >> USB_OTGSC_BSE_SHIFT)

/*
 * BSV (RO)
 *
 * BSV
 * B Session Valid - Read Only.
 * Indicates VBus is above the B session valid threshold.
 */
#define USB_OTGSC_BSV_MASK (0x800U)
#define USB_OTGSC_BSV_SHIFT (11U)
#define USB_OTGSC_BSV_GET(x) (((uint32_t)(x) & USB_OTGSC_BSV_MASK) >> USB_OTGSC_BSV_SHIFT)

/*
 * ASV (RO)
 *
 * ASV
 * A Session Valid - Read Only.
 * Indicates VBus is above the A session valid threshold.
 */
#define USB_OTGSC_ASV_MASK (0x400U)
#define USB_OTGSC_ASV_SHIFT (10U)
#define USB_OTGSC_ASV_GET(x) (((uint32_t)(x) & USB_OTGSC_ASV_MASK) >> USB_OTGSC_ASV_SHIFT)

/*
 * AVV (RO)
 *
 * AVV
 * A VBus Valid - Read Only.
 * Indicates VBus is above the A VBus valid threshold.
 */
#define USB_OTGSC_AVV_MASK (0x200U)
#define USB_OTGSC_AVV_SHIFT (9U)
#define USB_OTGSC_AVV_GET(x) (((uint32_t)(x) & USB_OTGSC_AVV_MASK) >> USB_OTGSC_AVV_SHIFT)

/*
 * ID (RO)
 *
 * ID
 * USB ID - Read Only.
 * 0 = A device, 1 = B device
 */
#define USB_OTGSC_ID_MASK (0x100U)
#define USB_OTGSC_ID_SHIFT (8U)
#define USB_OTGSC_ID_GET(x) (((uint32_t)(x) & USB_OTGSC_ID_MASK) >> USB_OTGSC_ID_SHIFT)

/*
 * IDPU (RW)
 *
 * IDPU
 * ID Pullup - Read/Write
 * This bit provide control over the ID pull-up resistor; 0 = off, 1 = on [default]. When this bit is 0, the ID input
 * will not be sampled.
 */
#define USB_OTGSC_IDPU_MASK (0x20U)
#define USB_OTGSC_IDPU_SHIFT (5U)
#define USB_OTGSC_IDPU_SET(x) (((uint32_t)(x) << USB_OTGSC_IDPU_SHIFT) & USB_OTGSC_IDPU_MASK)
#define USB_OTGSC_IDPU_GET(x) (((uint32_t)(x) & USB_OTGSC_IDPU_MASK) >> USB_OTGSC_IDPU_SHIFT)

