hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * DP (RW)
 *
 * DP
 * Data Pulsing - Read/Write.
 * Setting this bit causes the pullup on DP to be asserted for data pulsing during SRP.
 */
#define USB_OTGSC_DP_MASK (0x10U)
#define USB_OTGSC_DP_SHIFT (4U)
#define USB_OTGSC_DP_SET(x) (((uint32_t)(x) << USB_OTGSC_DP_SHIFT) & USB_OTGSC_DP_MASK)
#define USB_OTGSC_DP_GET(x) (((uint32_t)(x) & USB_OTGSC_DP_MASK) >> USB_OTGSC_DP_SHIFT)

/*
 * OT (RW)
 *
 * OT
 * OTG Termination - Read/Write.
 * This bit must be set when the OTG device is in device mode, this controls the pulldown on DM.
 */
#define USB_OTGSC_OT_MASK (0x8U)
#define USB_OTGSC_OT_SHIFT (3U)
#define USB_OTGSC_OT_SET(x) (((uint32_t)(x) << USB_OTGSC_OT_SHIFT) & USB_OTGSC_OT_MASK)
#define USB_OTGSC_OT_GET(x) (((uint32_t)(x) & USB_OTGSC_OT_MASK) >> USB_OTGSC_OT_SHIFT)

/*
 * VC (RW)
 *
 * VC
 * VBUS Charge - Read/Write.
 * Setting this bit causes the VBus line to be charged. This is used for VBus pulsing during SRP.
 */
#define USB_OTGSC_VC_MASK (0x2U)
#define USB_OTGSC_VC_SHIFT (1U)
#define USB_OTGSC_VC_SET(x) (((uint32_t)(x) << USB_OTGSC_VC_SHIFT) & USB_OTGSC_VC_MASK)
#define USB_OTGSC_VC_GET(x) (((uint32_t)(x) & USB_OTGSC_VC_MASK) >> USB_OTGSC_VC_SHIFT)

/*
 * VD (RW)
 *
 * VD
 * VBUS_Discharge - Read/Write.
 * Setting this bit causes VBus to discharge through a resistor.
 */
#define USB_OTGSC_VD_MASK (0x1U)
#define USB_OTGSC_VD_SHIFT (0U)
#define USB_OTGSC_VD_SET(x) (((uint32_t)(x) << USB_OTGSC_VD_SHIFT) & USB_OTGSC_VD_MASK)
#define USB_OTGSC_VD_GET(x) (((uint32_t)(x) & USB_OTGSC_VD_MASK) >> USB_OTGSC_VD_SHIFT)

/* Bitfield definition for register: USBMODE */
/*
 * SDIS (RW)
 *
 * SDIS
 * Stream Disable Mode. (0 - Inactive [default]; 1 - Active)
 * Device Mode: Setting to a '1' disables double priming on both RX and TX for low bandwidth systems. This
 * mode ensures that when the RX and TX buffers are sufficient to contain an entire packet that the
 * standard double buffering scheme is disabled to prevent overruns/underruns in bandwidth limited
 * systems. Note: In High Speed Mode, all packets received are responded to with a NYET handshake
 * when stream disable is active.
 * Host Mode: Setting to a '1' ensures that overruns/underruns of the latency FIFO are eliminated for low
 * bandwidth systems where the RX and TX buffers are sufficient to contain the entire packet. Enabling
 * stream disable also has the effect of ensuring the TX latency is filled to capacity before the packet is
 * launched onto the USB.
 * NOTE: Time duration to pre-fill the FIFO becomes significant when stream disable is active. See
 * TXFILLTUNING and TXTTFILLTUNING [MPH Only] to characterize the adjustments needed for
 * the scheduler when using this feature.
 * NOTE: The use of this feature substantially limits of the overall USB performance that can be achieved.
 */
#define USB_USBMODE_SDIS_MASK (0x10U)
#define USB_USBMODE_SDIS_SHIFT (4U)
#define USB_USBMODE_SDIS_SET(x) (((uint32_t)(x) << USB_USBMODE_SDIS_SHIFT) & USB_USBMODE_SDIS_MASK)
#define USB_USBMODE_SDIS_GET(x) (((uint32_t)(x) & USB_USBMODE_SDIS_MASK) >> USB_USBMODE_SDIS_SHIFT)

/*
 * SLOM (RW)
 *
 * SLOM
 * Setup Lockout Mode. In device mode, this bit controls behavior of the setup lock mechanism. See Control
 * Endpoint Operation Model .
 * 0 - Setup Lockouts On (default);
 * 1 - Setup Lockouts Off. DCD requires use of Setup Data Buffer Tripwire in USBCMD.
 */
#define USB_USBMODE_SLOM_MASK (0x8U)
#define USB_USBMODE_SLOM_SHIFT (3U)
#define USB_USBMODE_SLOM_SET(x) (((uint32_t)(x) << USB_USBMODE_SLOM_SHIFT) & USB_USBMODE_SLOM_MASK)
#define USB_USBMODE_SLOM_GET(x) (((uint32_t)(x) & USB_USBMODE_SLOM_MASK) >> USB_USBMODE_SLOM_SHIFT)

/*
 * ES (RW)
 *
 * ES
 * Endian Select - Read/Write. This bit can change the byte alignment of the transfer buffers to match the
 * host microprocessor. The bit fields in the microprocessor interface and the data structures are unaffected
 * by the value of this bit because they are based upon the 32-bit word.
 * Bit Meaning
 * 0 - Little Endian [Default]
 * 1 - Big Endian
 */
#define USB_USBMODE_ES_MASK (0x4U)
#define USB_USBMODE_ES_SHIFT (2U)
#define USB_USBMODE_ES_SET(x) (((uint32_t)(x) << USB_USBMODE_ES_SHIFT) & USB_USBMODE_ES_MASK)
#define USB_USBMODE_ES_GET(x) (((uint32_t)(x) & USB_USBMODE_ES_MASK) >> USB_USBMODE_ES_SHIFT)

/*
 * CM (RW)
 *
 * CM
 * Controller Mode - R/WO. Controller mode is defaulted to the proper mode for host only and device only
 * implementations. For those designs that contain both host & device capability, the controller defaults to
 * an idle state and needs to be initialized to the desired operating mode after reset. For combination host/
 * device controllers, this register can only be written once after reset. If it is necessary to switch modes,
 * software must reset the controller by writing to the RESET bit in the USBCMD register before
 * reprogramming this register.
 * For OTG controller core, reset value is '00b'.
 * 00 - Idle [Default for combination host/device]
 * 01 - Reserved
 * 10 - Device Controller [Default for device only controller]
 * 11 - Host Controller [Default for host only controller]
 */
#define USB_USBMODE_CM_MASK (0x3U)
#define USB_USBMODE_CM_SHIFT (0U)
#define USB_USBMODE_CM_SET(x) (((uint32_t)(x) << USB_USBMODE_CM_SHIFT) & USB_USBMODE_CM_MASK)
#define USB_USBMODE_CM_GET(x) (((uint32_t)(x) & USB_USBMODE_CM_MASK) >> USB_USBMODE_CM_SHIFT)

/* Bitfield definition for register: ENDPTSETUPSTAT */
/*
 * ENDPTSETUPSTAT (RWC)
 *
 * ENDPTSETUPSTAT
 * Setup Endpoint Status. For every setup transaction that is received, a corresponding bit in this register is
 * set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit
 * after it has read the setup data from Queue head. The response to a setup packet as in the order of
 * operations and total response time is crucial to limit bus time outs while the setup lock our mechanism is
 * engaged. See Managing Endpoints in the Device Operational Model.
 * This register is only used in device mode.
 */
#define USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_MASK (0xFFFFU)
#define USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_SHIFT (0U)
#define USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_SET(x) (((uint32_t)(x) << USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_SHIFT) & USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_MASK)
#define USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_GET(x) (((uint32_t)(x) & USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_MASK) >> USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_SHIFT)

/* Bitfield definition for register: ENDPTPRIME */
/*
 * PETB (RWS)
 *
 * PETB
 * Prime Endpoint Transmit Buffer - R/WS. For each endpoint a corresponding bit is used to request that a
 * buffer is prepared for a transmit operation in order to respond to a USB IN/INTERRUPT transaction.
 * Software should write a one to the corresponding bit when posting a new transfer descriptor to an
 * endpoint queue head. Hardware automatically uses this bit to begin parsing for a new transfer descriptor
 * from the queue head and prepare a transmit buffer. Hardware clears this bit when the associated
 * endpoint(s) is (are) successfully primed.
 * NOTE: These bits are momentarily set by hardware during hardware re-priming operations when a dTD
 * is retired, and the dQH is updated.
 * PETB[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTPRIME_PETB_MASK (0xFF0000UL)
#define USB_ENDPTPRIME_PETB_SHIFT (16U)
#define USB_ENDPTPRIME_PETB_SET(x) (((uint32_t)(x) << USB_ENDPTPRIME_PETB_SHIFT) & USB_ENDPTPRIME_PETB_MASK)
#define USB_ENDPTPRIME_PETB_GET(x) (((uint32_t)(x) & USB_ENDPTPRIME_PETB_MASK) >> USB_ENDPTPRIME_PETB_SHIFT)

