hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * PERB (RWS)
 *
 * PERB
 * Prime Endpoint Receive Buffer - R/WS. For each endpoint, a corresponding bit is used to request a buffer
 * prepare for a receive operation for when a USB host initiates a USB OUT transaction. Software should
 * write a one to the corresponding bit whenever posting a new transfer descriptor to an endpoint queue
 * head. Hardware automatically uses this bit to begin parsing for a new transfer descriptor from the queue
 * head and prepare a receive buffer. Hardware clears this bit when the associated endpoint(s) is (are)
 * successfully primed.
 * NOTE: These bits are momentarily set by hardware during hardware re-priming operations when a dTD
 * is retired, and the dQH is updated.
 * PERB[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTPRIME_PERB_MASK (0xFFU)
#define USB_ENDPTPRIME_PERB_SHIFT (0U)
#define USB_ENDPTPRIME_PERB_SET(x) (((uint32_t)(x) << USB_ENDPTPRIME_PERB_SHIFT) & USB_ENDPTPRIME_PERB_MASK)
#define USB_ENDPTPRIME_PERB_GET(x) (((uint32_t)(x) & USB_ENDPTPRIME_PERB_MASK) >> USB_ENDPTPRIME_PERB_SHIFT)

/* Bitfield definition for register: ENDPTFLUSH */
/*
 * FETB (RWS)
 *
 * FETB
 * Flush Endpoint Transmit Buffer - R/WS. Writing one to a bit(s) in this register causes the associated
 * endpoint(s) to clear any primed buffers. If a packet is in progress for one of the associated endpoints,
 * then that transfer continues until completion. Hardware clears this register after the endpoint flush
 * operation is successful.
 * FETB[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTFLUSH_FETB_MASK (0xFF0000UL)
#define USB_ENDPTFLUSH_FETB_SHIFT (16U)
#define USB_ENDPTFLUSH_FETB_SET(x) (((uint32_t)(x) << USB_ENDPTFLUSH_FETB_SHIFT) & USB_ENDPTFLUSH_FETB_MASK)
#define USB_ENDPTFLUSH_FETB_GET(x) (((uint32_t)(x) & USB_ENDPTFLUSH_FETB_MASK) >> USB_ENDPTFLUSH_FETB_SHIFT)

/*
 * FERB (RWS)
 *
 * FERB
 * Flush Endpoint Receive Buffer - R/WS. Writing one to a bit(s) causes the assocUOGiated endpoint(s) to
 * clear any primed buffers. If a packet is in progress for one of the associated endpoints, then that transfer
 * continues until completion. Hardware clears this register after the endpoint flush operation is successful.
 * FERB[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTFLUSH_FERB_MASK (0xFFU)
#define USB_ENDPTFLUSH_FERB_SHIFT (0U)
#define USB_ENDPTFLUSH_FERB_SET(x) (((uint32_t)(x) << USB_ENDPTFLUSH_FERB_SHIFT) & USB_ENDPTFLUSH_FERB_MASK)
#define USB_ENDPTFLUSH_FERB_GET(x) (((uint32_t)(x) & USB_ENDPTFLUSH_FERB_MASK) >> USB_ENDPTFLUSH_FERB_SHIFT)

/* Bitfield definition for register: ENDPTSTAT */
/*
 * ETBR (RO)
 *
 * ETBR
 * Endpoint Transmit Buffer Ready -- Read Only. One bit for each endpoint indicates status of the
 * respective endpoint buffer. This bit is set to one by the hardware as a response to receiving a command
 * from a corresponding bit in the ENDPTPRIME register. There is always a delay between setting a bit in
 * the ENDPTPRIME register and endpoint indicating ready. This delay time varies based upon the current
 * USB traffic and the number of bits set in the ENDPRIME register. Buffer ready is cleared by USB reset,
 * by the USB DMA system, or through the ENDPTFLUSH register.
 * NOTE: These bits are momentarily cleared by hardware during hardware endpoint re-priming operations
 * when a dTD is retired, and the dQH is updated.
 * ETBR[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTSTAT_ETBR_MASK (0xFF0000UL)
#define USB_ENDPTSTAT_ETBR_SHIFT (16U)
#define USB_ENDPTSTAT_ETBR_GET(x) (((uint32_t)(x) & USB_ENDPTSTAT_ETBR_MASK) >> USB_ENDPTSTAT_ETBR_SHIFT)

/*
 * ERBR (RO)
 *
 * ERBR
 * Endpoint Receive Buffer Ready -- Read Only. One bit for each endpoint indicates status of the respective
 * endpoint buffer. This bit is set to a one by the hardware as a response to receiving a command from a
 * corresponding bit in the ENDPRIME register. There is always a delay between setting a bit in the
 * ENDPRIME register and endpoint indicating ready. This delay time varies based upon the current USB
 * traffic and the number of bits set in the ENDPRIME register. Buffer ready is cleared by USB reset, by the
 * USB DMA system, or through the ENDPTFLUSH register.
 * NOTE: These bits are momentarily cleared by hardware during hardware endpoint re-priming operations
 * when a dTD is retired, and the dQH is updated.
 * ERBR[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTSTAT_ERBR_MASK (0xFFU)
#define USB_ENDPTSTAT_ERBR_SHIFT (0U)
#define USB_ENDPTSTAT_ERBR_GET(x) (((uint32_t)(x) & USB_ENDPTSTAT_ERBR_MASK) >> USB_ENDPTSTAT_ERBR_SHIFT)

/* Bitfield definition for register: ENDPTCOMPLETE */
/*
 * ETCE (RWC)
 *
 * ETCE
 * Endpoint Transmit Complete Event - R/WC. Each bit indicates a transmit event (IN/INTERRUPT)
 * occurred and software should read the corresponding endpoint queue to determine the endpoint status. If
 * the corresponding IOC bit is set in the Transfer Descriptor, then this bit is set simultaneously with the
 * USBINT . Writing one clears the corresponding bit in this register.
 * ETCE[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTCOMPLETE_ETCE_MASK (0xFF0000UL)
#define USB_ENDPTCOMPLETE_ETCE_SHIFT (16U)
#define USB_ENDPTCOMPLETE_ETCE_SET(x) (((uint32_t)(x) << USB_ENDPTCOMPLETE_ETCE_SHIFT) & USB_ENDPTCOMPLETE_ETCE_MASK)
#define USB_ENDPTCOMPLETE_ETCE_GET(x) (((uint32_t)(x) & USB_ENDPTCOMPLETE_ETCE_MASK) >> USB_ENDPTCOMPLETE_ETCE_SHIFT)

/*
 * ERCE (RWC)
 *
 * ERCE
 * Endpoint Receive Complete Event - RW/C. Each bit indicates a received event (OUT/SETUP) occurred
 * and software should read the corresponding endpoint queue to determine the transfer status. If the
 * corresponding IOC bit is set in the Transfer Descriptor, then this bit is set simultaneously with the
 * USBINT . Writing one clears the corresponding bit in this register.
 * ERCE[N] - Endpoint #N, N is in 0..7
 */
#define USB_ENDPTCOMPLETE_ERCE_MASK (0xFFU)
#define USB_ENDPTCOMPLETE_ERCE_SHIFT (0U)
#define USB_ENDPTCOMPLETE_ERCE_SET(x) (((uint32_t)(x) << USB_ENDPTCOMPLETE_ERCE_SHIFT) & USB_ENDPTCOMPLETE_ERCE_MASK)
#define USB_ENDPTCOMPLETE_ERCE_GET(x) (((uint32_t)(x) & USB_ENDPTCOMPLETE_ERCE_MASK) >> USB_ENDPTCOMPLETE_ERCE_SHIFT)

