hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/* Bitfield definition for register array: ENDPTCTRL */
/*
 * TXE (RW)
 *
 * TXE
 * TX Endpoint Enable
 * 0 Disabled [Default]
 * 1 Enabled
 * An Endpoint should be enabled only after it has been configured.
 */
#define USB_ENDPTCTRL_TXE_MASK (0x800000UL)
#define USB_ENDPTCTRL_TXE_SHIFT (23U)
#define USB_ENDPTCTRL_TXE_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_TXE_SHIFT) & USB_ENDPTCTRL_TXE_MASK)
#define USB_ENDPTCTRL_TXE_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_TXE_MASK) >> USB_ENDPTCTRL_TXE_SHIFT)

/*
 * TXR (WS)
 *
 * TXR
 * TX Data Toggle Reset (WS)
 * Write 1 - Reset PID Sequence
 * Whenever a configuration event is received for this Endpoint, software must write a one to this bit in order
 * to synchronize the data PID's between the Host and device.
 */
#define USB_ENDPTCTRL_TXR_MASK (0x400000UL)
#define USB_ENDPTCTRL_TXR_SHIFT (22U)
#define USB_ENDPTCTRL_TXR_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_TXR_SHIFT) & USB_ENDPTCTRL_TXR_MASK)
#define USB_ENDPTCTRL_TXR_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_TXR_MASK) >> USB_ENDPTCTRL_TXR_SHIFT)

/*
 * TXI (RW)
 *
 * TXI
 * TX Data Toggle Inhibit
 * 0 PID Sequencing Enabled. [Default]
 * 1 PID Sequencing Disabled.
 * This bit is only used for test and should always be written as zero. Writing a one to this bit causes this
 * endpoint to ignore the data toggle sequence and always transmit DATA0 for a data packet.
 */
#define USB_ENDPTCTRL_TXI_MASK (0x200000UL)
#define USB_ENDPTCTRL_TXI_SHIFT (21U)
#define USB_ENDPTCTRL_TXI_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_TXI_SHIFT) & USB_ENDPTCTRL_TXI_MASK)
#define USB_ENDPTCTRL_TXI_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_TXI_MASK) >> USB_ENDPTCTRL_TXI_SHIFT)

/*
 * TXT (RW)
 *
 * TXT
 * TX Endpoint Type - Read/Write
 * 00 Control
 * 01 Isochronous
 * 10 Bulk
 * 11 Interrupt
 */
#define USB_ENDPTCTRL_TXT_MASK (0xC0000UL)
#define USB_ENDPTCTRL_TXT_SHIFT (18U)
#define USB_ENDPTCTRL_TXT_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_TXT_SHIFT) & USB_ENDPTCTRL_TXT_MASK)
#define USB_ENDPTCTRL_TXT_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_TXT_MASK) >> USB_ENDPTCTRL_TXT_SHIFT)

/*
 * TXD (RW)
 *
 * TXD
 * TX Endpoint Data Source - Read/Write
 * 0 Dual Port Memory Buffer/DMA Engine [DEFAULT]
 * Should always be written as 0.
 */
#define USB_ENDPTCTRL_TXD_MASK (0x20000UL)
#define USB_ENDPTCTRL_TXD_SHIFT (17U)
#define USB_ENDPTCTRL_TXD_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_TXD_SHIFT) & USB_ENDPTCTRL_TXD_MASK)
#define USB_ENDPTCTRL_TXD_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_TXD_MASK) >> USB_ENDPTCTRL_TXD_SHIFT)

/*
 * TXS (RW)
 *
 * TXS
 * TX Endpoint Stall - Read/Write
 * 0 End Point OK
 * 1 End Point Stalled
 * This bit will be cleared automatically upon receipt of a SETUP request if this Endpoint is configured as a
 * Control Endpoint and this bit will continue to be cleared by hardware until the associated
 * ENDPTSETUPSTAT bit is cleared.
 * Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. This
 * control will continue to STALL until this bit is either cleared by software or automatically cleared as above
 * for control endpoints.
 * NOTE: [CONTROL ENDPOINT TYPES ONLY]: there is a slight delay (50 clocks max) between the
 * ENDPTSETUPSTAT begin cleared and hardware continuing to clear this bit. In most systems, it
 * is unlikely the DCD software will observe this delay. However, should the DCD observe that the
 * stall bit is not set after writing a one to it then follow this procedure: continually write this stall bit
 * until it is set or until a new setup has been received by checking the associated endptsetupstat
 * Bit.
 */
#define USB_ENDPTCTRL_TXS_MASK (0x10000UL)
#define USB_ENDPTCTRL_TXS_SHIFT (16U)
#define USB_ENDPTCTRL_TXS_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_TXS_SHIFT) & USB_ENDPTCTRL_TXS_MASK)
#define USB_ENDPTCTRL_TXS_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_TXS_MASK) >> USB_ENDPTCTRL_TXS_SHIFT)

/*
 * RXE (RW)
 *
 * RXE
 * RX Endpoint Enable
 * 0 Disabled [Default]
 * 1 Enabled
 * An Endpoint should be enabled only after it has been configured.
 */
#define USB_ENDPTCTRL_RXE_MASK (0x80U)
#define USB_ENDPTCTRL_RXE_SHIFT (7U)
#define USB_ENDPTCTRL_RXE_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_RXE_SHIFT) & USB_ENDPTCTRL_RXE_MASK)
#define USB_ENDPTCTRL_RXE_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_RXE_MASK) >> USB_ENDPTCTRL_RXE_SHIFT)

/*
 * RXR (WS)
 *
 * RXR
 * RX Data Toggle Reset (WS)
 * Write 1 - Reset PID Sequence
 * Whenever a configuration event is received for this Endpoint, software must write a one to this bit in order
 * to synchronize the data PID's between the host and device.
 */
#define USB_ENDPTCTRL_RXR_MASK (0x40U)
#define USB_ENDPTCTRL_RXR_SHIFT (6U)
#define USB_ENDPTCTRL_RXR_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_RXR_SHIFT) & USB_ENDPTCTRL_RXR_MASK)
#define USB_ENDPTCTRL_RXR_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_RXR_MASK) >> USB_ENDPTCTRL_RXR_SHIFT)

/*
 * RXI (RW)
 *
 * RXI
 * RX Data Toggle Inhibit
 * 0 Disabled [Default]
 * 1 Enabled
 * This bit is only used for test and should always be written as zero. Writing a one to this bit causes this
 * endpoint to ignore the data toggle sequence and always accept data packet regardless of their data PID.
 */
#define USB_ENDPTCTRL_RXI_MASK (0x20U)
#define USB_ENDPTCTRL_RXI_SHIFT (5U)
#define USB_ENDPTCTRL_RXI_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_RXI_SHIFT) & USB_ENDPTCTRL_RXI_MASK)
#define USB_ENDPTCTRL_RXI_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_RXI_MASK) >> USB_ENDPTCTRL_RXI_SHIFT)

/*
 * RXT (RW)
 *
 * RXT
 * RX Endpoint Type - Read/Write
 * 00 Control
 * 01 Isochronous
 * 10 Bulk
 * 11 Interrupt
 */
#define USB_ENDPTCTRL_RXT_MASK (0xCU)
#define USB_ENDPTCTRL_RXT_SHIFT (2U)
#define USB_ENDPTCTRL_RXT_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_RXT_SHIFT) & USB_ENDPTCTRL_RXT_MASK)
#define USB_ENDPTCTRL_RXT_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_RXT_MASK) >> USB_ENDPTCTRL_RXT_SHIFT)

/*
 * RXD (RW)
 *
 * RXD
 * RX Endpoint Data Sink - Read/Write
 * 0 Dual Port Memory Buffer/DMA Engine [Default]
 * Should always be written as zero.
 */
#define USB_ENDPTCTRL_RXD_MASK (0x2U)
#define USB_ENDPTCTRL_RXD_SHIFT (1U)
#define USB_ENDPTCTRL_RXD_SET(x) (((uint32_t)(x) << USB_ENDPTCTRL_RXD_SHIFT) & USB_ENDPTCTRL_RXD_MASK)
#define USB_ENDPTCTRL_RXD_GET(x) (((uint32_t)(x) & USB_ENDPTCTRL_RXD_MASK) >> USB_ENDPTCTRL_RXD_SHIFT)

