hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * SER_MODE_SUSPEND_EN (RW)
 *
 * for naneng usbphy, only switch to serial mode when suspend
 */
#define USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_MASK (0x10U)
#define USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_SHIFT (4U)
#define USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_SET(x) (((uint32_t)(x) << USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_SHIFT) & USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_MASK)
#define USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_GET(x) (((uint32_t)(x) & USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_MASK) >> USB_OTG_CTRL0_SER_MODE_SUSPEND_EN_SHIFT)

/* Bitfield definition for register: OTG_CTRL1 */
/*
 * OTG_DEBUG_SEL (RW)
 *
 * 
 */
#define USB_OTG_CTRL1_OTG_DEBUG_SEL_MASK (0xFU)
#define USB_OTG_CTRL1_OTG_DEBUG_SEL_SHIFT (0U)
#define USB_OTG_CTRL1_OTG_DEBUG_SEL_SET(x) (((uint32_t)(x) << USB_OTG_CTRL1_OTG_DEBUG_SEL_SHIFT) & USB_OTG_CTRL1_OTG_DEBUG_SEL_MASK)
#define USB_OTG_CTRL1_OTG_DEBUG_SEL_GET(x) (((uint32_t)(x) & USB_OTG_CTRL1_OTG_DEBUG_SEL_MASK) >> USB_OTG_CTRL1_OTG_DEBUG_SEL_SHIFT)

/* Bitfield definition for register: PHY_CTRL0 */
/*
 * GPIO_ID_SEL_N (RW)
 *
 * 
 */
#define USB_PHY_CTRL0_GPIO_ID_SEL_N_MASK (0x2000000UL)
#define USB_PHY_CTRL0_GPIO_ID_SEL_N_SHIFT (25U)
#define USB_PHY_CTRL0_GPIO_ID_SEL_N_SET(x) (((uint32_t)(x) << USB_PHY_CTRL0_GPIO_ID_SEL_N_SHIFT) & USB_PHY_CTRL0_GPIO_ID_SEL_N_MASK)
#define USB_PHY_CTRL0_GPIO_ID_SEL_N_GET(x) (((uint32_t)(x) & USB_PHY_CTRL0_GPIO_ID_SEL_N_MASK) >> USB_PHY_CTRL0_GPIO_ID_SEL_N_SHIFT)

/* Bitfield definition for register: PHY_CTRL1 */
/*
 * UTMI_SELF_TEST (RW)
 *
 * 
 */
#define USB_PHY_CTRL1_UTMI_SELF_TEST_MASK (0x200000UL)
#define USB_PHY_CTRL1_UTMI_SELF_TEST_SHIFT (21U)
#define USB_PHY_CTRL1_UTMI_SELF_TEST_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_SELF_TEST_SHIFT) & USB_PHY_CTRL1_UTMI_SELF_TEST_MASK)
#define USB_PHY_CTRL1_UTMI_SELF_TEST_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_SELF_TEST_MASK) >> USB_PHY_CTRL1_UTMI_SELF_TEST_SHIFT)

/*
 * UTMI_CFG_RST_N (RW)
 *
 * 
 */
#define USB_PHY_CTRL1_UTMI_CFG_RST_N_MASK (0x100000UL)
#define USB_PHY_CTRL1_UTMI_CFG_RST_N_SHIFT (20U)
#define USB_PHY_CTRL1_UTMI_CFG_RST_N_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_CFG_RST_N_SHIFT) & USB_PHY_CTRL1_UTMI_CFG_RST_N_MASK)
#define USB_PHY_CTRL1_UTMI_CFG_RST_N_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_CFG_RST_N_MASK) >> USB_PHY_CTRL1_UTMI_CFG_RST_N_SHIFT)

/*
 * UTMI_CFG_WEN (RW)
 *
 * 
 */
#define USB_PHY_CTRL1_UTMI_CFG_WEN_MASK (0x80000UL)
#define USB_PHY_CTRL1_UTMI_CFG_WEN_SHIFT (19U)
#define USB_PHY_CTRL1_UTMI_CFG_WEN_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_CFG_WEN_SHIFT) & USB_PHY_CTRL1_UTMI_CFG_WEN_MASK)
#define USB_PHY_CTRL1_UTMI_CFG_WEN_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_CFG_WEN_MASK) >> USB_PHY_CTRL1_UTMI_CFG_WEN_SHIFT)

/*
 * UTMI_CFG_REN (RW)
 *
 * 
 */
#define USB_PHY_CTRL1_UTMI_CFG_REN_MASK (0x40000UL)
#define USB_PHY_CTRL1_UTMI_CFG_REN_SHIFT (18U)
#define USB_PHY_CTRL1_UTMI_CFG_REN_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_CFG_REN_SHIFT) & USB_PHY_CTRL1_UTMI_CFG_REN_MASK)
#define USB_PHY_CTRL1_UTMI_CFG_REN_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_CFG_REN_MASK) >> USB_PHY_CTRL1_UTMI_CFG_REN_SHIFT)

/*
 * UTMI_CFG_ADDR (RW)
 *
 * 
 */
#define USB_PHY_CTRL1_UTMI_CFG_ADDR_MASK (0x3F000UL)
#define USB_PHY_CTRL1_UTMI_CFG_ADDR_SHIFT (12U)
#define USB_PHY_CTRL1_UTMI_CFG_ADDR_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_CFG_ADDR_SHIFT) & USB_PHY_CTRL1_UTMI_CFG_ADDR_MASK)
#define USB_PHY_CTRL1_UTMI_CFG_ADDR_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_CFG_ADDR_MASK) >> USB_PHY_CTRL1_UTMI_CFG_ADDR_SHIFT)

/*
 * UTMI_CFG_WDATA (RW)
 *
 * 
 */
#define USB_PHY_CTRL1_UTMI_CFG_WDATA_MASK (0xFF0U)
#define USB_PHY_CTRL1_UTMI_CFG_WDATA_SHIFT (4U)
#define USB_PHY_CTRL1_UTMI_CFG_WDATA_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_CFG_WDATA_SHIFT) & USB_PHY_CTRL1_UTMI_CFG_WDATA_MASK)
#define USB_PHY_CTRL1_UTMI_CFG_WDATA_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_CFG_WDATA_MASK) >> USB_PHY_CTRL1_UTMI_CFG_WDATA_SHIFT)

/*
 * UTMI_PLL_SEL (RW)
 *
 * assign  utmi_pll_en  = usb_phyctrl1[2] ? usb_phyctrl1[3] : utmi_suspendm
 */
#define USB_PHY_CTRL1_UTMI_PLL_SEL_MASK (0x4U)
#define USB_PHY_CTRL1_UTMI_PLL_SEL_SHIFT (2U)
#define USB_PHY_CTRL1_UTMI_PLL_SEL_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_PLL_SEL_SHIFT) & USB_PHY_CTRL1_UTMI_PLL_SEL_MASK)
#define USB_PHY_CTRL1_UTMI_PLL_SEL_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_PLL_SEL_MASK) >> USB_PHY_CTRL1_UTMI_PLL_SEL_SHIFT)

/*
 * UTMI_OTG_SUSPENDM (RW)
 *
 * OTG suspend, not utmi_suspendm
 */
#define USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_MASK (0x2U)
#define USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_SHIFT (1U)
#define USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_SET(x) (((uint32_t)(x) << USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_SHIFT) & USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_MASK)
#define USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_GET(x) (((uint32_t)(x) & USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_MASK) >> USB_PHY_CTRL1_UTMI_OTG_SUSPENDM_SHIFT)

/* Bitfield definition for register: TOP_STATUS */
/*
 * WAKEUP_INT_STATUS (RW)
 *
 * 
 */
#define USB_TOP_STATUS_WAKEUP_INT_STATUS_MASK (0x80000000UL)
#define USB_TOP_STATUS_WAKEUP_INT_STATUS_SHIFT (31U)
#define USB_TOP_STATUS_WAKEUP_INT_STATUS_SET(x) (((uint32_t)(x) << USB_TOP_STATUS_WAKEUP_INT_STATUS_SHIFT) & USB_TOP_STATUS_WAKEUP_INT_STATUS_MASK)
#define USB_TOP_STATUS_WAKEUP_INT_STATUS_GET(x) (((uint32_t)(x) & USB_TOP_STATUS_WAKEUP_INT_STATUS_MASK) >> USB_TOP_STATUS_WAKEUP_INT_STATUS_SHIFT)

/* Bitfield definition for register: PHY_STATUS */
/*
 * UTMI_CLK_VALID (RW)
 *
 * 
 */
#define USB_PHY_STATUS_UTMI_CLK_VALID_MASK (0x80000000UL)
#define USB_PHY_STATUS_UTMI_CLK_VALID_SHIFT (31U)
#define USB_PHY_STATUS_UTMI_CLK_VALID_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_UTMI_CLK_VALID_SHIFT) & USB_PHY_STATUS_UTMI_CLK_VALID_MASK)
#define USB_PHY_STATUS_UTMI_CLK_VALID_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_UTMI_CLK_VALID_MASK) >> USB_PHY_STATUS_UTMI_CLK_VALID_SHIFT)

/*
 * UTMI_TEST_BIST (RW)
 *
 * 
 */
#define USB_PHY_STATUS_UTMI_TEST_BIST_MASK (0x10000UL)
#define USB_PHY_STATUS_UTMI_TEST_BIST_SHIFT (16U)
#define USB_PHY_STATUS_UTMI_TEST_BIST_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_UTMI_TEST_BIST_SHIFT) & USB_PHY_STATUS_UTMI_TEST_BIST_MASK)
#define USB_PHY_STATUS_UTMI_TEST_BIST_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_UTMI_TEST_BIST_MASK) >> USB_PHY_STATUS_UTMI_TEST_BIST_SHIFT)

