hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_usb_regs.h
/*
 * UTMI_CFG_RDATA (RW)
 *
 * 
 */
#define USB_PHY_STATUS_UTMI_CFG_RDATA_MASK (0xFF00U)
#define USB_PHY_STATUS_UTMI_CFG_RDATA_SHIFT (8U)
#define USB_PHY_STATUS_UTMI_CFG_RDATA_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_UTMI_CFG_RDATA_SHIFT) & USB_PHY_STATUS_UTMI_CFG_RDATA_MASK)
#define USB_PHY_STATUS_UTMI_CFG_RDATA_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_UTMI_CFG_RDATA_MASK) >> USB_PHY_STATUS_UTMI_CFG_RDATA_SHIFT)

/*
 * LINE_STATE (RW)
 *
 * 
 */
#define USB_PHY_STATUS_LINE_STATE_MASK (0xC0U)
#define USB_PHY_STATUS_LINE_STATE_SHIFT (6U)
#define USB_PHY_STATUS_LINE_STATE_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_LINE_STATE_SHIFT) & USB_PHY_STATUS_LINE_STATE_MASK)
#define USB_PHY_STATUS_LINE_STATE_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_LINE_STATE_MASK) >> USB_PHY_STATUS_LINE_STATE_SHIFT)

/*
 * HOST_DISCONNECT (RW)
 *
 * 
 */
#define USB_PHY_STATUS_HOST_DISCONNECT_MASK (0x20U)
#define USB_PHY_STATUS_HOST_DISCONNECT_SHIFT (5U)
#define USB_PHY_STATUS_HOST_DISCONNECT_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_HOST_DISCONNECT_SHIFT) & USB_PHY_STATUS_HOST_DISCONNECT_MASK)
#define USB_PHY_STATUS_HOST_DISCONNECT_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_HOST_DISCONNECT_MASK) >> USB_PHY_STATUS_HOST_DISCONNECT_SHIFT)

/*
 * ID_DIG (RW)
 *
 * 
 */
#define USB_PHY_STATUS_ID_DIG_MASK (0x10U)
#define USB_PHY_STATUS_ID_DIG_SHIFT (4U)
#define USB_PHY_STATUS_ID_DIG_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_ID_DIG_SHIFT) & USB_PHY_STATUS_ID_DIG_MASK)
#define USB_PHY_STATUS_ID_DIG_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_ID_DIG_MASK) >> USB_PHY_STATUS_ID_DIG_SHIFT)

/*
 * UTMI_SESS_END (RW)
 *
 * 
 */
#define USB_PHY_STATUS_UTMI_SESS_END_MASK (0x8U)
#define USB_PHY_STATUS_UTMI_SESS_END_SHIFT (3U)
#define USB_PHY_STATUS_UTMI_SESS_END_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_UTMI_SESS_END_SHIFT) & USB_PHY_STATUS_UTMI_SESS_END_MASK)
#define USB_PHY_STATUS_UTMI_SESS_END_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_UTMI_SESS_END_MASK) >> USB_PHY_STATUS_UTMI_SESS_END_SHIFT)

/*
 * UTMI_SESS_VALID (RW)
 *
 * 
 */
#define USB_PHY_STATUS_UTMI_SESS_VALID_MASK (0x4U)
#define USB_PHY_STATUS_UTMI_SESS_VALID_SHIFT (2U)
#define USB_PHY_STATUS_UTMI_SESS_VALID_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_UTMI_SESS_VALID_SHIFT) & USB_PHY_STATUS_UTMI_SESS_VALID_MASK)
#define USB_PHY_STATUS_UTMI_SESS_VALID_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_UTMI_SESS_VALID_MASK) >> USB_PHY_STATUS_UTMI_SESS_VALID_SHIFT)

/*
 * UTMI_B_VALID (RW)
 *
 * 
 */
#define USB_PHY_STATUS_UTMI_B_VALID_MASK (0x2U)
#define USB_PHY_STATUS_UTMI_B_VALID_SHIFT (1U)
#define USB_PHY_STATUS_UTMI_B_VALID_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_UTMI_B_VALID_SHIFT) & USB_PHY_STATUS_UTMI_B_VALID_MASK)
#define USB_PHY_STATUS_UTMI_B_VALID_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_UTMI_B_VALID_MASK) >> USB_PHY_STATUS_UTMI_B_VALID_SHIFT)

/*
 * VBUS_VALID (RW)
 *
 * 
 */
#define USB_PHY_STATUS_VBUS_VALID_MASK (0x1U)
#define USB_PHY_STATUS_VBUS_VALID_SHIFT (0U)
#define USB_PHY_STATUS_VBUS_VALID_SET(x) (((uint32_t)(x) << USB_PHY_STATUS_VBUS_VALID_SHIFT) & USB_PHY_STATUS_VBUS_VALID_MASK)
#define USB_PHY_STATUS_VBUS_VALID_GET(x) (((uint32_t)(x) & USB_PHY_STATUS_VBUS_VALID_MASK) >> USB_PHY_STATUS_VBUS_VALID_SHIFT)



/* ENDPTCTRL register group index macro definition */
#define USB_ENDPTCTRL_ENDPTCTRL0 (0UL)
#define USB_ENDPTCTRL_ENDPTCTRL1 (1UL)
#define USB_ENDPTCTRL_ENDPTCTRL2 (2UL)
#define USB_ENDPTCTRL_ENDPTCTRL3 (3UL)
#define USB_ENDPTCTRL_ENDPTCTRL4 (4UL)
#define USB_ENDPTCTRL_ENDPTCTRL5 (5UL)
#define USB_ENDPTCTRL_ENDPTCTRL6 (6UL)
#define USB_ENDPTCTRL_ENDPTCTRL7 (7UL)


#endif /* HPM_USB_H */